[
  {
    "course code": "CSCI0020",
    "title": "The Digital World",
    "url": "https://cs.brown.edu/courses/info/csci0020/",
    "description": "Removes the mystery surrounding computers and the ever-growing digital world. Introduces a range of topics and many aspects of multimedia, along with explanations of the underlying digital technology and its relevance to our society. Other topics include artificial intelligence, IT security, ethics and the economics of computing as well as the effects of its pervasiveness in today's world. Introductory programming and analytic skills are developed through Excel, HTML, CSS, Javascript, and Python assignments. CSCI0020 is a good introduction to a wide range of CS topics that have broad relevance in our society. No prerequisites. Cannot be taken to fulfill CS Concentration.",
    "instructor": "Donald L Stanford",
    "meets": "TTh 9am-10:20am in Metcalf Research Building AUD"
  },
  {
    "course code": "CSCI0030",
    "title": "Introduction to Computation for the Humanities and Social Sciences",
    "url": "https://cs.brown.edu/courses/info/csci0030/",
    "description": "Introduces students to the use of computation for solving problems in the social sciences and the humanities. We will investigate a series of real-world problems taken from the news, from books such as Freakonomics, and from current research. Topics covered include data gathering, analysis, and visualization; web-based interfaces; algorithms; and scripting. Enrollment limited to 25. Instructor permission required.\nStudents wishing to register must add themselves to the waitlist here: https://forms.gle/WaRkLmTMagCA6YXY8\nThis course was taught as CSCI 0931 until spring '16.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0040",
    "title": "Introduction to Scientific Computing and Problem Solving",
    "url": "https://cs.brown.edu/courses/info/csci0040/",
    "description": "CSCI0040 provides an introduction to using computers to solve STEM (Science, Technology, Engineering and Mathematics) data analysis, visualization and simulation problems from engineering, neuroscience, biology, mathematics and finance. Students will access and analyze a number of \"real world\" data sets while becoming fluent MATLAB programmers. Other tools utilized may include Excel, Wolframalpha and Python. \nBy course end, students should be able to use MATLAB to solve a large variety of scientific data analysis, visualization and simulation problems. \nNo prior programming experience is required (MATLAB is easy and fun to use).",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0050",
    "title": "A Data-Centric Introduction to Programming",
    "url": "https://cs.brown.edu/courses/info/csci0050/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0060",
    "title": "Practical Systems Skills",
    "url": "https://cs.brown.edu/courses/info/csci0060/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0080",
    "title": "A First Byte of Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci0080/",
    "description": "Introduces non-CS concentrators to the academic discipline of computer science, its thought processes, and its relevance to other fields and modern life more generally. The target audience is students who are interested in learning more about what computer science is about and the ideas it has to offer tomorrow's citizens and scholars. Topics include the basics of computation and programming, a taste of theoretical computer science and algorithms, and an introduction to codes and artificial intelligence. Although students will learn to read and understand short programs, the course will not teach or require advanced programming skills. LILE",
    "instructor": "Michael L. Littman",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0081",
    "title": "TA Apprenticeship: Full Credit",
    "url": "https://cs.brown.edu/courses/info/csci0081/",
    "description": "Being an undergraduate TA is a learning experience: one not only gets a deeper understanding of the course material, but gains management and social skills that are invaluable for one's future. Students taking this course must first be selected as an undergraduate TA for a Computer Science course, a course the student has taken and done well in. Students will work with the course's instructor on a variety of course-related topics, including preparation of material and development of assignments. Whether CSCI 0081 or its half-credit version (CSCI 0082) is taken is up to the professor of the course being TA'd. Instructor permission required.",
    "instructor": "Kathi Fisler",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0082",
    "title": "TA Apprenticeship: Half Credit",
    "url": "https://cs.brown.edu/courses/info/csci0082/",
    "description": "Being an undergraduate TA is a learning experience: one not only gets a deeper understanding of the course material, but gains management and social skills that are invaluable for one's future. Students taking this course must first be selected as an undergraduate TA for a Computer Science course, a course the student has taken and done well in. Students will work with the course's instructor on a variety of course-related topics, including preparation of material and development of assignments. Whether CSCI 0082 or its full-credit version (CSCI 0081) is taken is up to the professor of the course being TA'd. Instructor permission required.",
    "instructor": "Kathi Fisler",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0100",
    "title": "Data Fluency for All",
    "url": "https://cs.brown.edu/courses/info/csci0100/",
    "description": "This course is intended to introduce Brown students to computational techniques that data scientists use to tell stories. Data fluency encompasses both data literacy, the basics of statistics and machine learning, and data communication, which relies heavily on principles of design. Students will gain hands on experience using statistical tools such as 'R' to analyze real world data sets, and 'ggplot' to visualize them. Sample application domains include just about every field, since the only requirement is data, which there almost always are (e.g., the complete works of Shakespeare is a sample data set).",
    "instructor": "Amy R Greenwald",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0111",
    "title": "Computing Foundations: Data",
    "url": "https://cs.brown.edu/courses/info/csci0111/",
    "description": "An introduction to computing and programming that focuses on understanding and manipulating data. Students will learn to write programs to process both tabular and structured data, to assess programs both experimentally and theoretically, to apply basic data science concepts, and to discuss big ideas around the communication, use, and social impacts of digital information. Designed for both concentrators and non-concentrators, this is the first course in either a two- or three-course introductory sequence leading into advanced CS courses. Programming assignments will be smaller scale than in CSCI 0150/0170, thus allowing students time to practice programming and discuss computational ideas in a broader context.",
    "instructor": "Milda Zizyte",
    "meets": "MWF 10am-10:50am in Metcalf Research Building AUD"
  },
  {
    "course code": "CSCI0112",
    "title": "Computing Foundations: Program Organization",
    "url": "https://cs.brown.edu/courses/info/csci0112/",
    "description": "Explores how organization of programs, data, and algorithms affects metrics such as time performance, space usage, social impacts, and data privacy. Students will learn how to choose between candidate data structures for a problem, how to write programs over several standard data structures, how to assess the quality of programs (from theoretical, practical, and social perspectives), and how to apply their skills to computational problems that could arise in a variety of fields. The course will teach object-oriented programming, in combination with basic functional and imperative programming concepts. The course is designed for both concentrators and non-concentrators. Prerequisite: CSCI 0111",
    "instructor": "Tim Nelson",
    "meets": "MWF 1pm-1:50pm in Smith-Buonanno Hall G18"
  },
  {
    "course code": "CSCI0130",
    "title": "User Interfaces and User Experience",
    "url": "https://cs.brown.edu/courses/info/csci0130/",
    "description": "Have you ever had trouble using someone else’s microwave? Have you ever wondered why keyboards are ordered “qwertyuiop”? We will focus on hands-on experience to learn when to use different interfaces, how to model and represent user interaction, how to elicit requirements and feedback from users, as well as the principles of user experience design, methods for designing and prototyping interfaces, and user interface evaluation. Students interested in gaining hands-on experience designing a user interface as well as learning the process behind building an effective interface should take this course. There will be assignments, readings, and workshop time, where students will have the opportunity to work alongside each other as they learn critical tools for interface and web design. This course is open to students that have not taken CSCI 1300 or CSCI 0130 in the past.\nAn application to join the course will be released to students on the first day of class.",
    "instructor": "Talie Massachi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0150",
    "title": "Introduction to Object-Oriented Programming and Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci0150/",
    "description": "Introduces programming in Java (a modern, widely-used programming language), interactive 2D computer graphics, and some fundamental data structures and algorithms. Students learn by programming a sequence of interactive graphics programs which gradually increase in complexity, including Doodle Jump, Tetris (http://bastilleweb.techhouse.org/) and a significant final project. Lectures are supplemented by skits performed by the UTAs (Undergraduate Teaching Assistants) to teach course concepts and for a bit of added entertainment! This course is intended for both potential concentrators and those who may take only a single course. There are NO prerequisites, and no prior knowledge of programming is required, though students who do have prior programming experience are also encouraged to take the course!",
    "instructor": "Andries van Dam",
    "meets": "TTh 2:30pm-3:50pm in Salomon Center DECI"
  },
  {
    "course code": "CSCI0160",
    "title": "Introduction to Algorithms and Data Structures",
    "url": "https://cs.brown.edu/courses/info/csci0160/",
    "description": "This course teaches fundamental techniques for problem solving by computer that are relevant to most areas of Computer Science, both theoretical and applied. Algorithms and data structures for sorting, searching, graph problems and geometric problems are covered. Programming assignments conform with the object-oriented methodology introduced in CSCI0150. Prerequisite: CSCI0150 or written permission.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0170",
    "title": "CS: An Integrated Introduction",
    "url": "https://cs.brown.edu/courses/info/csci0170/",
    "description": "CSCI 0170 is a computer science introduction suitable for students with no prior experience. It focuses on functional programming, which provides a new experience for students who have already done some programming and a solid foundation for students who have never programmed at all. Students learn to design solutions to computational problems, solutions that are compact, elegant, and efficient. Over the course of the semester, the computational problems addressed grow in complexity, from simple (e.g. long addition) to moderate (e.g. implementation of one programming language in another) to sophisticated (e.g. an implementation of an AI game player for two-person games of complete information). We study clear and precise formulation of computational problems, use of recursion, and rudimentary analysis of algorithms. The emphasis is on problem solving and insight and crafting beautiful things rather than on coding.",
    "instructor": "Philip Klein",
    "meets": "MW 3pm-4:20pm in Friedman Hall 108"
  },
  {
    "course code": "CSCI0180",
    "title": "CS: An Integrated Introduction",
    "url": "https://cs.brown.edu/courses/info/csci0180/",
    "description": "A continuation of CSCI0170. Students learn to program in Java while continuing to develop their algorithmic and analytic skills. Emphasis is placed on object-oriented design, imperative programming, and the implementation and use of data structures. Examples are drawn from such areas as databases, strategy games, web programming, graphical user interfaces, route finding, and data compression. Lab work done with the assistance of TAs. Prerequisite: CSCI 0170 or CSCi 0190.",
    "instructor": "Kathi Fisler",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0190",
    "title": "Accelerated Introduction to Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci0190/",
    "description": "A one-semester introduction to CS, similar to the two-course introductory sequences (CSCI 0150-0200 and CSCI 0170-0200).All interested students, irrespective of background, must pass online placement assignments during the summer. Though placement is most appropriate for students with some prior programming experience, it is self-contained so all are welcome to try learning the provided material and attempting placement. Information will be available by June 1st at https://cs.brown.edu/courses/csci0190/.Please do not request override codes. Override requests made through CAB will be ignored. The only way to get into the class is through placement. Students who do not successfully pass the placement process won't be allowed to register. Students who do pass will be sent registration instructions by course staff; you do not need to contact them (nor make requests through CAB).",
    "instructor": "Shriram Krishnamurthi",
    "meets": "MWF 9am-9:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI0200",
    "title": "Program Design with Data Structures and Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci0200/",
    "description": "Students extend their program-design skills while learning multiple data structures, common graph algorithms, different forms of societal impacts from programs, how to analyze programs for performance, and how to work effectively with multiple styles of programming languages. Examples and course projects draw from several areas of computer science to help students identify their broader interests within the field. There will be a required weekly lab session involving hands-on work with course material.Prerequisite: CSCI 0112, CSCI 0150, 0170, or CSCI 0190. In addition, CSCI 0111 can be used with both additional work and the instructor's permission. The first two weeks of the course will be taught as at least two parallel tracks based on which prerequisite course a student has taken.CSCI 0200 will be offered every semester (fall and spring).",
    "instructor": "Nick DeMarinis",
    "meets": "MWF 2pm-2:50pm in CIT Center (Thomas Watson CIT) 165 (9/4 to 9/10)\nMWF 2pm-2:50pm in Kassar House FOX (9/11 to 12/21)"
  },
  {
    "course code": "CSCI0220",
    "title": "Introduction to Discrete Structures and Probability",
    "url": "https://cs.brown.edu/courses/info/csci0220/",
    "description": "Seeks to place on solid foundations the most common structures of computer science, to illustrate proof techniques, to provide the background for an introductory course in computational theory, and to introduce basic concepts of probability theory. Introduces Boolean algebras, logic, set theory, elements of algebraic structures, graph theory, combinatorics, and probability. No prerequisites.",
    "instructor": "Robert Y. Lewis\n          \n\n\n\n            Ellis Hershkowitz",
    "meets": "MWF 1pm-1:50pm in Salomon Center 001"
  },
  {
    "course code": "CSCI0300",
    "title": "Fundamentals of Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci0300/",
    "description": "Covers fundamental concepts, principles, and abstractions that underlie the design and engineering of computer systems. Students will learn how a computer works, how to write safe and performant systems software, and what systems abstractions support today’s complex, high-performance systems developed in industry. Specific topics include machine organization, systems programming and performance, key concepts of operating systems, isolation, security, virtualization, concurrent programming, and the basics of distributed systems. Combined lectures, labs, and several hands-on projects involving programming exercises in C/C++. Prerequisites: CSCI 0160, 0180, 0190, or 0200; or permission of the instructor.",
    "instructor": "Nick DeMarinis",
    "meets": "TTh 1pm-2:20pm in MacMillan Hall 117"
  },
  {
    "course code": "CSCI0310",
    "title": "Introduction to Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci0310/",
    "description": "This course has been retired. Thank you, Pascal!\nThis course covers the basic principles behind the organization of modern computers. It starts with machine representation of data types and logic design, then explores the architecture and operations of computer systems, including I/O, pipelining, and memory hierarchies. Assembly language is introduced as an intermediate abstraction and is used to study introductory operating system and compiler concepts. Prerequisite: CSCI0150, CSCI0180 or CSCI0190.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0320",
    "title": "Introduction to Software Engineering",
    "url": "https://cs.brown.edu/courses/info/csci0320/",
    "description": "Focuses on designing, building, testing, and maintaining systems collaboratively. It covers programming techniques (using Java and TypeScript with various frameworks), object-oriented design, advanced testing (e.g., fuzz testing), debugging approaches, and tools such as source control systems. The course concludes with a major group project that students gather requirements for, then design and implement themselves. Prerequisite: CSCI 0160, 0180, CSCI 0190 or CSCI 0200; CSCI 0220 is recommended.",
    "instructor": "Tim Nelson",
    "meets": "TTh 1pm-2:20pm in 85 Waterman Street 130"
  },
  {
    "course code": "CSCI0330",
    "title": "Introduction to Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci0330/",
    "description": "High-level computer architecture and systems programming. The course covers the organization of computer systems (in terms of storage units, caches, processors, and I/O controllers) and teaches students assembly-language programming and C-language programming. Extensive programming exercises introduce students to systems-level programming on Unix systems, as well as to multi-threaded programming with POSIX threads. Students will be introduced to the functions of operating systems. Prerequisite: CSCI 0160, 0180, 0190, or 0200.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            Nick DeMarinis",
    "meets": "MWF 2pm-2:50pm in Salomon Center 001"
  },
  {
    "course code": "CSCI0360",
    "title": "Introduction to Systems Programming",
    "url": "https://cs.brown.edu/courses/info/csci0360/",
    "description": "This course teaches competency in systems-level programming, particularly using C and C++. Students learn how to produce code that is not only correct, but is also efficient, testable, maintainable, robust and secure. Basic software-design techniques are taught, along with the tools commonly used in systems programming. No prior knowledge of C or C++ is assumed, but students must know how to program in some language such as Java. Prerequisite: CSCI0310.",
    "instructor": "Thomas W Doeppner",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0410",
    "title": "Foundations of AI",
    "url": "https://cs.brown.edu/courses/info/csci0410/",
    "description": "This course will provide broad coverage of core topics in artificial intelligence (AI), as a prelude to students taking more in-depth AI courses later on. To this end, the course will introduce students to prevalent AI models, both logical and probabilistic, as well as algorithms to solve these models based on search, planning, reinforcement learning, and supervised and unsupervised machine learning. These ideas will be applied to develop basic natural language processing, computer vision, robotic, and multiagent systems, all with an eye towards building socially responsible AI. Students cannot take this course and 1411 together. This course is using a centralized override-request form for CS department. Add following \"All requests for overrides should be sent through that form. Override requests placed directly in C@B will be ignored. The form (and explanation of how it works) is available at https://cs.brown.edu/courses/enrolling/.\";",
    "instructor": "Eric A Ewing\n          \n\n\n\n            Amy R Greenwald",
    "meets": "MWF 1pm-1:50pm in List Art Center 120 (9/4 to 9/10)\nMWF 1pm-1:50pm in Salomon Center 001 (9/11 to 12/21)"
  },
  {
    "course code": "CSCI0450",
    "title": "Introduction to Probability and Computing",
    "url": "https://cs.brown.edu/courses/info/csci0450/",
    "description": "Probability and statistics have become indispensable tools in computer science. Probabilistic methods and statistical reasoning play major role in machine learning, cryptography, network security, communication protocols, web search engines, robotics, program verification, and more.\nThis course introduces the basic concepts of probability and statistics, focusing on topics that are most useful in computer science applications. Topics include: modeling and solution in sample space, random variables, simple random processes and their probability distributions, Markov processes, limit theorems, and basic elements of statistical inference.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0500",
    "title": "Data Structures, Algorithms, and Intractability: An Introduction",
    "url": "https://cs.brown.edu/courses/info/csci0500/",
    "description": "This course will cover the basics of how to design and analyze data structures and algorithms. We will develop algorithmic intuition through rigorous analysis of algorithmic correctness and performance. We will also study the theory of NP-completeness, which helps us understand which problems are computationally intractable.",
    "instructor": "Philip Klein",
    "meets": "MW 3pm-4:20pm in CIT Center (Thomas Watson CIT) 477 (1/22 to 2/2)\nMW 3pm-4:20pm in CIT Center (Thomas Watson CIT) 241 (2/3 to 5/16)"
  },
  {
    "course code": "CSCI0510",
    "title": "Models of Computation",
    "url": "https://cs.brown.edu/courses/info/csci0510/",
    "description": "THIS COURSE IS NOW BEING OFFERED AS CSCI 1010 AS OF FALL 2016\nThis course introduces basic models of computation including languages, finite-state automata and Turing machines.  Proves fundamental limits on computation (incomputability, the halting problem).  Provides the tools to compare the hardness of computational problems (reductions).  Introduces computational complexity classes (P, NP, PSPACE and others). Prerequisite: CSC0220.\nTHIS COURSE IS NOW BEING OFFERED AS CSCI 1010.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0530",
    "title": "Coding the Matrix: an Introduction to Linear Algebra for Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci0530/",
    "description": "An introduction to vectors and matrices and their role in computer science. The course material consists of three components: (1) concepts, theorems, and proofs, (2) procedures and programs, and (3) applications and working with data. The course revolves around weekly lab sessions in each of which students apply the concepts to a real task with real data. Lab topics include transformations in 2-d graphics, error-correcting codes, image compression using wavelets, synthesizing a new perspective in a photo, face recognition, news story categorization, cancer diagnosis using machine learning, matching airplanes to destinations, Google's PageRank method. Other topics addressed in the course include linear programming, zero-sum games, rudimentary cryptographic methods, linear regression, and discrete linear dynamical systems such as a spreading computer virus.\nThe Lab associated with this class is being held Fridays 3-4 in CIT 368\nNo formal prerequisites but students are expected to have some prior exposure to computer programming.",
    "instructor": "Philip Klein",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0920",
    "title": "Educational Software Seminar",
    "url": "https://cs.brown.edu/courses/info/csci0920/",
    "description": "Students examine the purpose, design, production, use and evaluation of educational software, electronically mediated curriculum, and other educational technologies, while working in teams to design software for clients in local classrooms (K-12 and university). CS4 or 15 is helpful, as is coursework or strong interest in education or digital production, but there are no prerequisites. Enrollment limited to 30; written permission required.\nTHIS COURSE HAS BEEN RETIRED.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI0931",
    "title": "Introduction to Computation for the Humanities and Social Sciences",
    "url": "https://cs.brown.edu/courses/info/csci0931/",
    "description": "Introduces students to the use of computation for solving problems in the social sciences and the humanities. We will investigate a series of real-world problems taken from the news, from books such as Freakonomics, and from current research. Topics covered include data gathering, analysis, and visualization; web-based interfaces; algorithms; and scripting. Enrollment limited to 25. Instructor permission required.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1010",
    "title": "Theory of Computation",
    "url": "https://cs.brown.edu/courses/info/csci1010/",
    "description": "The course introduces basic models of computation including languages, finite-state automata and Turing machines. Proves fundamental limits on computation (incomputability, the halting problem). Provides the tools to compare the hardness of computational problems (reductions). Introduces computational complexity classes (P, NP, PSPACE and others). Prerequisite: CSCI0220 or CSCI1450 or CSCI1550 or APMA1650/1655 or CSCI1570",
    "instructor": "Lorenzo De Stefani",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1040",
    "title": "The Basics of Cryptographic Systems",
    "url": "https://cs.brown.edu/courses/info/csci1040/",
    "description": "This course will cover cryptographic concepts such as data privacy, encryption, authentication, digital signatures, differential privacy, privacy-enhancing technologies, secure computation, and electronic money. The emphasis will be on how to use cryptographic systems correctly in a larger context, rather than on the mathematical details of how they work; although we will cover some of those details too, on a high level. This course will be aimed at practicing and aspiring poets, economists, software engineers, law and policy wonks, and business tycoons. No prerequisites.",
    "instructor": "Anna A Lysyanskaya",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI1230",
    "title": "Computer Graphics",
    "url": "https://cs.brown.edu/courses/info/csci1230/",
    "description": "Fundamental concepts in 2D and 3D computer graphics, e.g., 2D raster graphics techniques and simple image processing. Focuses on geometric transformations, and 3D modeling, viewing and rendering. A sequence of assignments in C++ culminates in a simple geometric modeler and ray tracer. Prerequisite: CSCI 0160, CSCI 0180, CSCI 0190, or CSCI 0200. Some knowledge of basic linear algebra is helpful but not required. Strong object-oriented programming ability (e.g., in C++, Java or Python) is required.",
    "instructor": "Daniel C Ritchie",
    "meets": "TTh 10:30am-11:50am in Smith-Buonanno Hall 106"
  },
  {
    "course code": "CSCI1234",
    "title": "Computer Graphics Lab",
    "url": "https://cs.brown.edu/courses/info/csci1234/",
    "description": "CSCI 1234 is a half-credit course intended to be taken concurrently with CSCI 1230 and provides students with a greater understanding of the material by having them extend each of 1230's assignments to greater depth.",
    "instructor": "Daniel C Ritchie",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1250",
    "title": "Introduction to Computer Animation",
    "url": "https://cs.brown.edu/courses/info/csci1250/",
    "description": "Introduction to 3D computer animation production including story writing, production planning, modeling, shading, animation, lighting, and compositing. The first part of the course leads students through progressive exercises that build on each other to learn basic skills in 2D and 3D animation. At each step, student work is evaluated for expressiveness, technical correctness and aesthetic qualities. Students then work in groups creating a polished short animation. Emphasis on in-class critique of ongoing work which is essential to the cycle of visually evaluating work in progress, determining improvements, and implementing them for further evaluation.\nPlease see course website for application procedure.",
    "instructor": "Barbara J. Meier",
    "meets": "MW 12pm-1:50pm in CIT Center (Thomas Watson CIT) 316"
  },
  {
    "course code": "CSCI1260",
    "title": "Compilers and Program Analysis",
    "url": "https://cs.brown.edu/courses/info/csci1260/",
    "description": "Lexical analysis, syntactic analysis, semantic analysis, code generation, code optimization, translator writing systems. Prerequisites: CSCI 0220, or CSCI 0320, or CSCI 0300, or CSCI 0330, or CSCI 1310, or CSCI 1330.",
    "instructor": "Robert Y. Lewis",
    "meets": "MW 3pm-4:20pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1270",
    "title": "Database Management Systems",
    "url": "https://cs.brown.edu/courses/info/csci1270/",
    "description": "Introduction to database systems internals, design and implementation. Includes data models and structures, languages, query processing and optimization, concurrency control and recovery algorithms. Coverage of relational distributed and parallel databases as well as noSQL big data systems. Prerequisites: One of CSCI 0300, 0330 (or equivalent coursework).",
    "instructor": "Ugur Cetintemel",
    "meets": "TTh 1pm-2:20pm in Metcalf Research Building AUD (9/4 to 9/11)\nTTh 1pm-2:20pm in Barus & Holley 168 (9/12 to 12/21)"
  },
  {
    "course code": "CSCI1280",
    "title": "Intermediate 3D Computer Animation",
    "url": "https://cs.brown.edu/courses/info/csci1280/",
    "description": "Continues work begun in CSCI 1250 with deeper exploration of technical and artistic aspects of 3D computer animation including more sophisticated shading and lighting methods and character modeling, rigging, animation, and dynamics. After a series of individual exercises, students pursue an independent topic and then, working alone or in pairs, create a polished demonstration. Emphasis is on in-class critique of ongoing work. Prerequisite: CSCI 1250. Students may contact the instructor in December for permission.",
    "instructor": "Barbara J. Meier",
    "meets": "MW 12pm-1:50pm in CIT Center (Thomas Watson CIT) 316"
  },
  {
    "course code": "CSCI1290",
    "title": "Computational Photography",
    "url": "https://cs.brown.edu/courses/info/csci1290/",
    "description": "Computational Photography describes the convergence of computer graphics and computer vision with photography. Its goal is to overcome the limitations of traditional photography using computational techniques to enhance the way we capture, manipulate, and interact with visual media.\nWe will cover topics such as cameras, human visual perception, image processing and manipulation, image based lighting and rendering, high dynamic range, single view reconstruction, photo quality assessment, non photorealistic rendering, the use of Internet-scale data, and many more topics. The course will consist of several programming assignments and a final project. Students are encouraged to capture and process their own data. Students can earn graduate credit for the course but will need to meet higher requirements on all projects throughout the semester and need the instructor's permission.\nThis course requires programming experience as well as basic linear algebra, calculus, and probability. This course requires programming experience as well as basic linear algebra, calculus, and probability. Previous knowledge of computer graphics or computer vision (e.g. CSCI 1230, CSCI 1430, ENGN 1610) will be helpful.",
    "instructor": "James H Tompkin",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1300",
    "title": "Interaction Design",
    "url": "https://cs.brown.edu/courses/info/csci1300/",
    "description": "Have you ever walked into a door thinking that you were supposed to pull instead of push? Have you ever been stuck on a website, not sure how to proceed next? Learn the principles of interaction design, methods for designing and prototyping interfaces, and user interface evaluation. Students interested in both learning the process behind designing a user interface should take this course. There will be assignments, readings, and studios, where students will have the opportunity to work alongside TAs and interact with industry guests as they learn critical tools for interaction design.Website: http://cs.brown.edu/courses/csci1300/",
    "instructor": "Jeff Huang",
    "meets": "TTh 1pm-2:20pm in Friedman Hall 108"
  },
  {
    "course code": "CSCI1301",
    "title": "Livestreaming Reimagined",
    "url": "https://cs.brown.edu/courses/info/csci1301/",
    "description": "Livestreaming today is comprised of video game streams and Zoom classes. But as video production becomes more accessible, and devices become more mobile, the blending of the Instagram photo feed and TV reality show could produce a new generation of streaming personalities. In this project-based course, we’ll investigate together the space of livestreaming technology beyond desktop gaming, exploring new configurations, interfaces, and improvements to current livestreaming systems. We’ll focus on creative (music, art, food, travel) or educational streaming, exploring how to support new forms of streamer-audience interaction and presence.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1302",
    "title": "Intro to Sociotechnical Systems and HCI",
    "url": "https://cs.brown.edu/courses/info/csci1302/",
    "description": "This course will explore how technological systems are designed and implemented within broader social, organizational, and ethical contexts. The course will also cover the unique considerations introduced by data-driven and AI systems, and what a sociotechnical lens can bring to their design. The course will introduce theory, methods, and ethical and policy considerations relevant to this space, including: qualitative interviews, participatory approaches, inclusive design, algorithmic justice, and data collection & visualization.",
    "instructor": "Harini Suresh\n          \n\n\n\n            Diana Freed",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI1310",
    "title": "Fundamentals of Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci1310/",
    "description": "Covers fundamental concepts, principles, and abstractions that underlie the design and engineering of computer systems, with reference to applications of these concepts in industry. Topics include machine organization, systems programming and performance, key concepts of operating systems, isolation, security, virtualization, concurrent programming, and the basics of distributed systems. Combined lectures, case studies, labs, and several hands-on projects involving programming exercises. This course is intended for Computer Science Master's students only. Anyone else wanting to take the course should contact the instructor.",
    "instructor": "Nick DeMarinis",
    "meets": "TTh 1pm-2:20pm in MacMillan Hall 117"
  },
  {
    "course code": "CSCI1320",
    "title": "Creating Modern & Mobile Web Applications",
    "url": "https://cs.brown.edu/courses/info/csci1320/",
    "description": "This course covers all aspects of web application development, including the initial concept, user-centric design, development methodologies, front end development, databases, back end development, security, testing, load testing, accessibility, and deployment. There will be a substantial team project. The course is designed both for students with substantial programming background (equivalent to CS32 or CS33) who want to learn how to use this background to build web applications, and for students with a substantial background in web design including HTML and Javascript who are interested in learning how to extend design techniques to incorporate the technologies needed in modern web applications. Project teams will consist of students with both types of backgrounds. this course, if taken in the senior year, will satisfy the capstone requirement for CS ScB concentrators.",
    "instructor": "Steven P Reiss",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1330",
    "title": "Computer Systems (Master's students only)",
    "url": "https://cs.brown.edu/courses/info/csci1330/",
    "description": "High-level computer architecture and systems programming. The course covers the organization of computer systems (in terms of storage units, caches, processors, and I/O controllers) and teaches students assembly-language programming and C-language programming. Extensive programming exercises introduce students to systems-level programming on Linux systems, as well as to multi-threaded programming with POSIX threads. Students will be introduced to the functions of operating systems.Enrollment limited to Master's students only.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            Nick DeMarinis",
    "meets": "MWF 2pm-2:50pm in Salomon Center 001"
  },
  {
    "course code": "CSCI1340",
    "title": "Introduction to Software Engineering",
    "url": "https://cs.brown.edu/courses/info/csci1340/",
    "description": "CSCI 1340 focuses on designing, building, testing, and maintaining systems collaboratively. It covers programming techniques (using Java and TypeScript with various frameworks), object-oriented design, advanced testing (e.g., fuzz testing), debugging approaches, and tools such as source control systems. The course concludes with a major group project that students gather requirements for, then design and implement themselves.Note: CSCI 1340 is for Master’s students only (they may not register for CSCI 0320). It is identical to 0320 but with the addition of supplemental work for each sprint. Prerequisite: CSCI 0160, CSCI 0180, CSCI 0190 or CSCI 0200; CSCI 0220 is recommended.",
    "instructor": "Tim Nelson",
    "meets": "TTh 1pm-2:20pm in 85 Waterman Street 130"
  },
  {
    "course code": "CSCI1360",
    "title": "Human Factors in Cybersecurity",
    "url": "https://cs.brown.edu/courses/info/csci1360/",
    "description": "For the most up to date information on this class, please visit this page: https://cs.brown.edu/courses/csci1360/ This course is designed to push you to think about cybersecurity as an idea with both physical and virtual elements. Throughout the course, we will examine the value of information, the importance of users, and the difficult balance between security and usability. The ultimate goal of this course is to give you the intellectual and scientific framework you need to create systems that are both secure and efficient to use. The course focuses on usable security practices, but also looks deeply at the way our society influences security",
    "instructor": "Ernesto Zaldivar",
    "meets": "W 3pm-5:30pm in CIT Center (Thomas Watson CIT) 506"
  },
  {
    "course code": "CSCI1370",
    "title": "Virtual Reality Design for Science",
    "url": "https://cs.brown.edu/courses/info/csci1370/",
    "description": "Explores the visual and human-computer interaction design process for scientific applications in Brown's immersive virtual reality Cave. Joint with RISD. Computer Science and design students learn how to work effectively together; study the process of design, learn about scientific problems, create designs for scientific applications; critique, evaluate, realize and iterate designs, and demonstrate final projects. Prerequisite: permission of the instructor.",
    "instructor": "David H. Laidlaw",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1380",
    "title": "Distributed Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci1380/",
    "description": "Explores the fundamental principles and practice underlying networked information systems, first we cover basic distributed computing mechanisms (e.g., naming, replication, security, etc.) and enabling middleware technologies. We then discuss how these mechanisms and technologies fit together to realize distributed databases and file systems, web-based and mobile information systems. Prerequisite: CSCI 0300, CSCI 0320, CSCI 0330, CSCI 1310 or CSCI 1330.",
    "instructor": "Nikos Vasilakis",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1385",
    "title": "Distributed Systems Laboratory",
    "url": "https://cs.brown.edu/courses/info/csci1385/",
    "description": "CSCI 1385 is a half-credit course intended to be taken concurrently with CSCI 1380 and provides students with a greater understanding of the material by having them extend each of 1380's assignments to greater depth.",
    "instructor": "Nikos Vasilakis",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1390",
    "title": "Systems for Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci1390/",
    "description": "Many applications, across industries varying from ecommerce to education, rely on data processing and machine learning systems for data analytics tasks. Deep learning techniques are now being applied to problems such as search, coding assistants, and chip placement. Due to how widely used these applications are, performance, specifically latency, throughput, and hardware efficiency, is very important. However, achieving high performance in these systems can be challenging. ML systems are run on different types of hardware accelerators (GPUs, TPUs) that have unique performance characteristics. Models are becoming larger and larger, and even with access to the most powerful hardware, systems must manage memory bandwidth and network bandwidth carefully when doing training and inference. Additionally, organizations deploying these large-scale ML systems tend to worry about more than just performance: they must worry about other factors such as energy usage, debuggability, and easy",
    "instructor": "Deepti Raghavan",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1410",
    "title": "Artificial Intelligence",
    "url": "https://cs.brown.edu/courses/info/csci1410/",
    "description": "Algorithms and representations used in artificial intelligence. Introduction and implementation of algorithms for search, planning, perception, knowledge representation, logic, probabilistic representation and reasoning, robotics and machine learning.",
    "instructor": "Thao Nguyen",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1411",
    "title": "Foundations in AI",
    "url": "https://cs.brown.edu/courses/info/csci1411/",
    "description": "This course will provide broad coverage of core topics in artificial intelligence (AI), as a prelude to students taking more in-depth AI courses later on. To this end, the course will introduce students to prevalent AI models, both logical and probabilistic, as well as algorithms to solve these models based on search, planning, reinforcement learning, and supervised and unsupervised machine learning. These ideas will be applied to develop basic natural language processing, computer vision, robotic, and multiagent systems, all with an eye towards building socially responsible AI. This course cannot be taken at the same time as 410. This course is using a centralized override-request for CS department. \"All requests for overrides should be sent through that form. Override requests placed directly in C@B will be ignored. The form (and explanation of how it works) is available at https://cs.brown.edu/courses/enrolling/.\";",
    "instructor": "Eric A Ewing\n          \n\n\n\n            Amy R Greenwald",
    "meets": "MWF 1pm-1:50pm in List Art Center 120 (9/4 to 9/10)\nMWF 1pm-1:50pm in Salomon Center 001 (9/11 to 12/21)"
  },
  {
    "course code": "CSCI1420",
    "title": "Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci1420/",
    "description": "How can artificial systems learn from examples and discover information buried in data? We explore the theory and practice of statistical machine learning, focusing on computational methods for supervised and unsupervised learning. Specific topics include empirical risk minimization, probably approximately correct learning, kernel methods, neural networks, maximum likelihood estimation, the expectation maximization algorithm, and principal component analysis. This course also aims to expose students to relevant ethical and societal considerations related to machine learning that may arise in practice. Please contact the instructor for information about the waitlist.",
    "instructor": "Stephen Bach",
    "meets": "TTh 2:30pm-3:50pm in Metcalf Research Building AUD"
  },
  {
    "course code": "CSCI1430",
    "title": "Computer Vision",
    "url": "https://cs.brown.edu/courses/info/csci1430/",
    "description": "How can we program computers to understand the visual world? This course treats vision as inference from noisy and uncertain data and emphasizes probabilistic and statistical approaches. Topics may include perception of 3D scene structure from stereo, motion, and shading; segmentation and grouping; texture analysis; learning, object recognition; tracking and motion estimation. Strongly recommended: basic linear algebra, calculus, and probability.",
    "instructor": "Srinath Sridhar",
    "meets": "TTh 9am-10:20am in MacMillan Hall 115 (9/4 to 9/11)\nTTh 9am-10:20am in Barus & Holley 166 (9/12 to 12/21)"
  },
  {
    "course code": "CSCI1440",
    "title": "Algorithmic Game Theory",
    "url": "https://cs.brown.edu/courses/info/csci1440/",
    "description": "This course examines topics in game theory and mechanism design from a computer scientist's perspective. Through the lens of computation, the focus is the design and analysis of systems utilized by self-interested agents. Students will investigate how the potential for strategic agent behavior can/should influence system design, and the ramifications of conflicts of interest between system designers and participating agents. Emphasis on computational tractability is paramount, so that simple designs are often preferred to optimal. Students will learn to analyze competing designs using the tools of theoretical computer science, and empirical tools, such as empirical game-theoretic analysis. Application areas include computational advertising, wireless spectrum, and prediction markets.",
    "instructor": "Amy R Greenwald",
    "meets": "W 3pm-5:30pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1450",
    "title": "Advanced Introduction to Probability for Computing and Data Science",
    "url": "https://cs.brown.edu/courses/info/csci1450/",
    "description": "Probability and statistics have become indispensable tools in computer science. Probabilistic methods and statistical reasoning play major roles in machine learning, cryptography, network security, communication protocols, web search engines, robotics, program verification, and more. This course introduces the basic concepts of probability and statistics, focusing on topics that are most useful in computer science applications. Topics include: modeling and solution in sample space, random variables, simple random processes and their probability distributions, Markov processes, limit theorems, and basic elements of Bayesian and frequentist statistical inference.\nPREREQUISITES: Two semesters of college-level calculus, at the level of MATH 0090 and MATH 0100. Basic programming experience required for homework assignments.",
    "instructor": "Eli Upfal\n          \n\nAlessio Mazzetto",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1460",
    "title": "Computational Linguistics",
    "url": "https://cs.brown.edu/courses/info/csci1460/",
    "description": "The application of computational methods to problems in natural-language processing. In particular we examine techniques due to recent advances in deep learning: word embeddings, recurrent neural networks (e.g., LSTMs), sequence-to-sequence models, and generative adversarial networks (GANs). Programming projects include sentiment classification, topic modelling and machine translation. Prerequisites are not strictly required, but the course will assume some knowledge of machine learning and deep learning, and will involve programming assignments in Python and PyTorch.",
    "instructor": "Ellie Pavlick",
    "meets": "TTh 2:30pm-3:50pm in Smith-Buonanno Hall 106"
  },
  {
    "course code": "CSCI1470",
    "title": "Deep Learning",
    "url": "https://cs.brown.edu/courses/info/csci1470/",
    "description": "What is deep learning? How is it related to machine learning? How is it applied to perform tasks like classifying images or translating languages? Deep Learning belongs to a broader family of machine learning methods. Deep learning-based methods (e.g., convolutional neural networks, recurrent neural networks, autoencoders) have led to rapid improvements in applications like computer vision, natural language processing, robotics, and even genomics and health. In this course, you will get an overview of the prominent techniques of deep learning and their applications. This course is designed to help you understand the underlying concepts as well as the promise and pitfalls of deep learning. It also aims at providing hands-on practice of implementing and applying deep learning methods in Python.",
    "instructor": "Eric A Ewing",
    "meets": "MWF 12pm-12:50pm in Salomon Center 001"
  },
  {
    "course code": "CSCI1480",
    "title": "Building Intelligent Robots",
    "url": "https://cs.brown.edu/courses/info/csci1480/",
    "description": "How do robots function autonomously in dynamic, unpredictable environments?  This course focuses on programming mobile robots, such as the iRobot Roomba, to perceive and act autonomously in real-world environments.  The major paradigms for autonomous control and robot perception are examined and compared with robotic notions in science fiction. Prerequisite: CSCI0150, CSCI0170 or CSCI0190. Recommended: CSCI1410 or CSCI1230.",
    "instructor": "Chad Jenkins",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1490",
    "title": "Introduction to Combinatorial Optimization",
    "url": "https://cs.brown.edu/courses/info/csci1490/",
    "description": "This course covers the algorithmic aspects of optimizing decisions in fully observable, non-changing environments. Students are introduced to state-of-the-art optimization methods such as linear programming, integer programming, local search, and constraint programming. Strongly recommended: CSCI0160, CSCI0180, or CSCI0190; CSCI0510; and CSCI0530 or MATH0520 or MATH0540.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1491",
    "title": "Fairness in Automated Decision Making",
    "url": "https://cs.brown.edu/courses/info/csci1491/",
    "description": "We know we want to build more equitable technology, but how? In this course we’ll review the latest developments in how to build more equitable algorithms, including definitions of (un)fairness, the challenges of explaining how ML works, making sure we can get accountability, and much more.",
    "instructor": "Suresh Venkatasubramanian\n          \n\nNasim Sonboli",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1510",
    "title": "Introduction to Cryptography and Computer Security",
    "url": "https://cs.brown.edu/courses/info/csci1510/",
    "description": "This course studies the tools for guaranteeing safe communication and computation in an adversarial setting. We develop notions of security and give provably secure constructions for such cryptographic objects as cryptosystems, signature schemes and pseudorandom generators. We also review the principles for secure system design. Prerequisites: CSCI 0220, and either CSCI 0510 or CSCI 1010.",
    "instructor": "Peihan Miao",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI1515",
    "title": "Applied Cryptography",
    "url": "https://cs.brown.edu/courses/info/csci1515/",
    "description": "This course teaches cryptography from a practical perspective and provides hands-on experience of building secure systems in C/C++. Students will implement secure authentication and communication systems using foundational cryptographic algorithms such as encryption schemes, authentication codes, digital signatures, key exchange, and hash functions. The course also covers advanced topics including zero-knowledge proofs, secure multi-party computation, fully homomorphic encryption, and post-quantum cryptography. Students will use these tools to develop applications such as secure online anonymous voting, privacy-preserving data analysis, and private information retrieval.",
    "instructor": "Peihan Miao",
    "meets": "MW 3pm-4:20pm in Salomon Center 001"
  },
  {
    "course code": "CSCI1520",
    "title": "Algorithmic Aspects of Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci1520/",
    "description": "In this course, we will explore the theoretical foundations of machine learning and deep learning. We will focus on designing and analyzing machine learning algorithms with provable guarantees. More specifically, in this course we will (1) introduce basic tools in linear algebra and optimization, including the power method, singular value decomposition, matrix calculus, (matrix) concentration inequalities, and (stochastic) gradient descent, (2) cover many examples where one can design algorithms with provably guarantees for fundamental problems in machine learning (under certain assumptions), including topic modeling, tensor decomposition, sparse coding, and matrix completion, and (3) discuss the emerging theory of deep learning, including landscape analysis, generalization and over-parameterization, neural tangent kernels, generalization bounds, and implicit regularization.",
    "instructor": "Yu Cheng",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI1550",
    "title": "Probabilistic Methods in Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci1550/",
    "description": "Randomization and probabilistic techniques play an important role in modern computer science, with applications ranging from combinatorial optimization and machine learning to communications networks and secure protocols. This course introduces the most fundamental probabilistic techniques used in computer science applications, in particular in randomized algorithms, probabilistic analysis of algorithms and machine learning.\nPrerequisite: Basic background in probability theory course such as CSCI 1450.",
    "instructor": "Eli Upfal",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI1570",
    "title": "Design and Analysis of Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci1570/",
    "description": "A single algorithmic improvement can have a greater impact on our ability to solve a problem than ten years of incremental improvements in CPU speed. We study techniques for designing and analyzing algorithms. Typical problem areas addressed include hashing, searching, dynamic programming, graph algorithms, network flow, and optimization algorithms including linear programming. Prerequisites: CSCI 0160, CSCI 0180, or CSCI 0190, and one of CSCI 0220, CSCI 1010, CSCI 1450, MATH 0750, MATH 1010, MATH 1530.",
    "instructor": "Lorenzo De Stefani",
    "meets": "TTh 2:30pm-3:50pm in Friedman Hall 202 (9/4 to 9/17)\nTTh 2:30pm-3:50pm in Salomon Center 001 (9/18 to 12/21)"
  },
  {
    "course code": "CSCI1575",
    "title": "Algorithms: In Depth",
    "url": "https://cs.brown.edu/courses/info/csci1575/",
    "description": "Half-credit course intended to be taken with CSCI 1570. Students will explore each topic in greater depth by collaboratively solving homework problems that will reinforce valuable new perspectives on the material. Corequisite: CSCI 1570.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1580",
    "title": "Information Retrieval and Web Search",
    "url": "https://cs.brown.edu/courses/info/csci1580/",
    "description": "Covers traditional material as well as recent advances in information retrieval (IR), the study of indexing, processing, and querying of textual data. The focus will be on newer techniques geared to hypertext documents available on the World Wide Web. Topics include efficient text indexing; Boolean and vector space retrieval models; evaluation and interface issues; Web crawling, link-based algorithms, and Web metadata; text/Web clustering, classification; text mining.\nNo prerequisites.",
    "instructor": "Eli Upfal\n          \n\n\n\n            Tim K Kraska",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1590",
    "title": "Introduction to Computational Complexity",
    "url": "https://cs.brown.edu/courses/info/csci1590/",
    "description": "Introduction to serial and parallel models of computation; time and space complexity classes on these models; the circuit model of computation and its relation to serial and parallel time complexity; space-time tradeoffs on serial computers; area-time tradeoffs on the VLSI computational model; interactive and probabilistically checkable proofs; the definition of NP in terms of probabilistically checkable proofs; hardness of approximations to solutions to NP-hard problems. Prerequisite: CSCI 0510.",
    "instructor": "John E Savage",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1600",
    "title": "Real-time and Embedded Software",
    "url": "https://cs.brown.edu/courses/info/csci1600/",
    "description": "Comprehensive introduction to the design and implementation of software for programmable embedded computing systems, in applications such as Internet of Things, transportation, and mobile. Includes the overall embedded real-time software design and development processes, with a focus on engineering for reliability. Major project component. Prerequisites: one of CSCI 0300, CSCI 0320, CSCI 0330, CSCI 1310, or CSCI 1330",
    "instructor": "Milda Zizyte",
    "meets": "MWF 12pm-12:50pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1610",
    "title": "Building High-Performance Servers",
    "url": "https://cs.brown.edu/courses/info/csci1610/",
    "description": "In-depth study of modern server design. Considers architectures for building high-performance, robust, scalable and secure servers. We consider all aspects of 'mission-critical' servers. Topics include threaded and non-blocking programming paradigms, high-performance I/O (network and disk), secure programming techniques, database access, performance profiling, security, and redundancy. Teams will build significant projects. Prerequisite: CSCI0320 or CSCI0360. Recommended: CSCI1670 and CSCI1680.",
    "instructor": "John H Jannotti",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1620",
    "title": "Computer Systems Security Lab",
    "url": "https://cs.brown.edu/courses/info/csci1620/",
    "description": "This course is a half-credit lab intended to be taken concurrently with CS1660 and provides students with a deeper understanding of the material by doing advanced versions of the cs1660’s projects. These advanced versions focus on real-world skills: performing attacks that are more difficult and rely on less serious vulnerabilities, performing attacks against systems with more real-world constraints, and creating attacks that achieve a higher standard of quality than a mere “proof of concept.”Instructor permission required.",
    "instructor": "Bernardo Palazzi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1640",
    "title": "AI and Security",
    "url": "https://cs.brown.edu/courses/info/csci1640/",
    "description": "Artificial Intelligence (AI) concerns the design of machines that perceive the environment and learn from experience to act wisely. Security concerns the protection against machines that exploit opportunities and behave maliciously to inflict harm. CSCI1640 will study these two fast-growing, practice-relevant and life-impactful CS fields, conjointly, as they relate, influence or apply to each other. With new concepts introduced from the ground up and using both a holistic and an analytical exposition of ideas, CSCI1640 will address the question of “How do AI and Security intersect, interleave or interfere?” and will cover a variety of topics around the impact that AI has to Security and the role that Security has in AI. Topics include trustworthy and privacy-preserving Machine Learning (ML), secure federated learning, crypto-enhanced neural networks, adversarial ML, ML-based security and cyberattacks, rational cryptography, generative AI, AI safety and superintelligence.",
    "instructor": "Nikos Triandopoulos",
    "meets": "M 3pm-5:30pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1650",
    "title": "Software Security and Exploitation",
    "url": "https://cs.brown.edu/courses/info/csci1650/",
    "description": "CSCI 1650 covers software exploitation techniques and state-of-the-art mechanisms for hardening software. The course begins with a summary of prevalent software defects, typically found in applications written in memory unsafe languages, like C/C++, and proceeds with studying traditional and modern exploitation techniques, ranging from classical code injection and code reuse up to the latest goodies (e.g., JIT-ROP). For the most part, it focuses on defenses against certain vulnerability classes and the way(s) to bypass them. Students will be introduced to advanced software exploitation techniques and countermeasures, and study (in depth) the boundaries and effectiveness of standard hardening mechanisms, such as address space randomization and stack and heap protections.",
    "instructor": "Vasileios Kemerlis",
    "meets": "MW 3pm-4:20pm in Salomon Center 001"
  },
  {
    "course code": "CSCI1660",
    "title": "Computer Systems Security",
    "url": "https://cs.brown.edu/courses/info/csci1660/",
    "description": "This course teaches principles of computer security from an applied viewpoint and provides hands-on experience on security threats and countermeasures. Topics include code execution vulnerabilities (buffer overflow, sandboxing, mobile code), malware (trojans, viruses, and worms), access control (users, roles, policies), cryptosystems (hashing, signatures, certificates), network security (firewalls, TLS, intrusion detection, VPN), and human and social issues. Prerequisites: one of (CSCI 0160, 0180, or 0190) and (CSCI 0300, 0330, 1310, or 1330). To be added to the course waitlist, please fill out this form: https://forms.gle/pHPAy9ntQkAQ7xLD9",
    "instructor": "Bernardo Palazzi\n          \n\n\n\n            Nikos Triandopoulos",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1670",
    "title": "Operating Systems",
    "url": "https://cs.brown.edu/courses/info/csci1670/",
    "description": "Covers not just the principles of operating systems but the intricacies of how they work. Topics include multithreaded programming, managing threads and interrupts, managing storage, processor scheduling, operating-system structure, virtualization, security, and the design of file systems (both local and distributed). Extensive examples are taken from actual systems, including Linux and Windows. Students are expected to complete both problem sets and programming assignments (in C). Prerequisite: CSCI 0300, 0330, 1310, or 1330.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            Malte Schwarzkopf",
    "meets": "MWF 2pm-2:50pm in Metcalf Research Building AUD"
  },
  {
    "course code": "CSCI1675",
    "title": "Designing High-Performance Network Systems",
    "url": "https://cs.brown.edu/courses/info/csci1675/",
    "description": "How can we understand the performance of network systems and make them run faster? To explore this question, we will break it down into pieces, including (i) how to define and measure a system’s performance, (ii) how to determine what factors in the system’s design affect its performance, and (iii) how to use this information to make the system faster. Through lectures, labs, readings, and hands-on programming projects, we will explore topics including tradeoffs between threads and coroutines, blocking and non-blocking execution models, cooperative and preemptive multitasking, open and closed request generation, and throughput-latency curves. Hands-on projects will involve modern Linux technologies such as perf and derivative tools, io_uring, eBPF, and XDP as well as modern microservice architecture tools such as nginx, kubernetes, and distributed tracing frameworks. The class will consist of lectures, short homework assignments that reinforce lecture content,",
    "instructor": "Akshay Narayan",
    "meets": "MW 9am-10:20am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1680",
    "title": "Computer Networks",
    "url": "https://cs.brown.edu/courses/info/csci1680/",
    "description": "Covers the technologies supporting the Internet, from Ethernet and WiFi through the routing protocols that govern the flow of traffic and the web technologies that are generating most of it. A major concern is understanding the protocols used on the Internet: what the issues are, how they work, their shortcomings, and what improvements are on the horizon. Prerequisite: CSCI 0300, 0330,1310,1330 or consent of instructor.",
    "instructor": "Nick DeMarinis",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1690",
    "title": "Operating Systems Laboratory",
    "url": "https://cs.brown.edu/courses/info/csci1690/",
    "description": "Half-credit course intended to be taken with CSCI 1670. Students individually write a simple operating system in C. Serves to reinforce the concepts learned in 1670 and provides valuable experience in systems programming. Corequisite: CSCI 1670.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            Malte Schwarzkopf",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1695",
    "title": "Operating System Design and Implementation",
    "url": "https://cs.brown.edu/courses/info/csci1695/",
    "description": "Students work together with the instructor to design and implement improvements to the Weenix operating system -- the OS used for student projects in CSCI 1670 and 1690. Topics include support for 64-bit architectures, kernel preemption, multi-core processors, as well as packaging the system for pedagogical use in 1670 and 1690.Prerequisite: CSCI 1690.",
    "instructor": "Thomas W Doeppner",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1710",
    "title": "Logic for Systems",
    "url": "https://cs.brown.edu/courses/info/csci1710/",
    "description": "The course will focus on proving properties about systems and programs. We will study the distinction between programs and specifications, and check for whether the former obey the latter. We will work with tools that have extensive automation such as model constructors, model checkers, and proof assistants. Problems and projects will apply to real-world systems. Prerequisite: CSCI 0160, CSCI 0180, CSCI 0190, or CSCI 0200. Preferred but not required: CSCI 0220",
    "instructor": "Tim Nelson",
    "meets": "W 10am-10:50am in 85 Waterman Street 015 (1/22 to 1/23)\nMWF 10am-10:50am in Friedman Hall 108 (1/24 to 5/16)"
  },
  {
    "course code": "CSCI1715",
    "title": "Formal Proof and Verification",
    "url": "https://cs.brown.edu/courses/info/csci1715/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1729",
    "title": "Programming Languages Lab",
    "url": "https://cs.brown.edu/courses/info/csci1729/",
    "description": "Half-credit course intended to be taken concurrently with CSCI 1730. Students individually implement a full programming language chosen by the course. Reinforces the concepts learned in CSCI 1730 and provides valuable experience in implementing programming languages. Corequisite: CSCI 1730",
    "instructor": "Shriram Krishnamurthi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1730",
    "title": "Design and Implementation of Programming Languages",
    "url": "https://cs.brown.edu/courses/info/csci1730/",
    "description": "Explores the design principles of modern programming languages through implementation, comparison, and reflection. Examines a variety of linguistic features that impact both control and data. Topics vary by year; more information on the course home page. Prerequisite: CSCI 0160, CSCI 0180 or CSCI 0190.",
    "instructor": "Shriram Krishnamurthi",
    "meets": "MWF 11am-11:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1760",
    "title": "Multiprocessor Synchronization",
    "url": "https://cs.brown.edu/courses/info/csci1760/",
    "description": "This course examines the theory and practice of multiprocessor synchronization. Subjects covered include multiprocessor architecture, mutual exclusion, wait-free and lock-free synchronization, spin locks, monitors, load balancing, concurrent data structures, and transactional synchronization. Prerequisites: CSCI 0330",
    "instructor": "Maurice P Herlihy",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI1780",
    "title": "Parallel and Distributed Programming",
    "url": "https://cs.brown.edu/courses/info/csci1780/",
    "description": "This course covers the practical aspects involved in designing, writing, tuning and debugging software designed to run on parallel and distributed systems. Topics might include client-server computation, threads, networks of workstations, message passing, shared memory, partitioning strategies, load-balancing algorithms, remote procedure call, and synchronization techniques. Prerequisites: CSCI0220 and either CSCI0320 or CSCI0510.  Recommended: CSCI0510.",
    "instructor": "Steven P Reiss",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1800",
    "title": "Cybersecurity and International Relations",
    "url": "https://cs.brown.edu/courses/info/csci1800/",
    "description": "The global Internet shortens distances, makes businesses more efficient and facilitates greater social interaction. At the same time, it exposes vital national resources to exploitation and makes it easier for the international criminal element to prey on innocent Internet users. Cybersecurity is concerned with making the Internet a more secure and trustworthy environment. In this course we study this topic from the technological and policy points of view. The goal is to facilitate communication across the divide that normally characterizes the technological and policy communities.",
    "instructor": "Ernesto Zaldivar",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI1805",
    "title": "Computers, Freedom and Privacy: Current Topics in Law and Policy",
    "url": "https://cs.brown.edu/courses/info/csci1805/",
    "description": "Who is the Big Brother that we most fear? Is it the NSA -- or is it Google and Facebook? Rapidly changing social mores and the growing problem of cybersecurity have all contributed to a sense that privacy is dead. Laws protecting privacy and civil liberties are stuck in the analog age, while the capabilities for mass digital surveillance continue to advance rapidly. This course will examine a variety of informational privacy and technology issues. A major theme: the historical and contemporary struggle to bring surveillance under democratic control to protect against abuses of privacy, civil liberties and human rights.",
    "instructor": "Timothy H Edgar",
    "meets": "TTh 9am-10:20am in Barus & Holley 168"
  },
  {
    "course code": "CSCI1810",
    "title": "Computational Molecular Biology",
    "url": "https://cs.brown.edu/courses/info/csci1810/",
    "description": "High-throughput experimental approaches now allow molecular biologists to make large-scale measurements of DNA, RNA, and protein, the three fundamental molecules of the cell. The resulting datasets are often too large for manual analysis and demand computational techniques. This course introduces algorithms for sequence comparison and alignment; molecular evolution and phylogenetics; DNA/RNA sequencing and assembly; recognition of genes and regulatory elements; and RNA and protein structure. The course demonstrates how to model biological problems in terms of computer science.\nPrerequisites: CSCI 0160, CSCI 0180 or CSCI 0190, or consent of instructor.",
    "instructor": "Sorin Istrail",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI1820",
    "title": "Algorithmic Foundations of Computational Biology",
    "url": "https://cs.brown.edu/courses/info/csci1820/",
    "description": "This course is devoted to computational and statistical methods as well as software tools for DNA, RNA, and protein sequence analysis. The focus is on understanding the algorithmic and mathematical foundations of the methods, the design of the associated genomics tools, as well as on their applications. A comprehensive set of programming assignments provides a hands-on journey for the student into the complexities of real genomic data. These include: basic components of a genome assembler, mapping sets of sequences to the genome, as those generated by high-throughput sequencing like Illumina/Solexa and 454, a BLAST-like search tool, HMM algorithms for gene prediction, suffix trees, motif prediction for transcription factors promoters, and genome mapping of genetic variation of SNPs, haplotypes, and copy number. The course has several unifying themes such as alignment, comparative genomics, protein structure, the newly unveiled role of RNA in the regulatory genome, and the intertwining of statistics and algorithmics in the design of powerful genomic tools.\nThe course is open to computer and mathematical sciences students as well as biological and medical students. \nBoth advanced undergraduates and graduate students are welcome. Biomed students compensate for programming assignments with comparable work for a final project. Graduate credit is obtained by a final project devoted to a research problem. Two grassroots projects are being built gradually by final projects of students in this class. Genomathica is a library of biologist-friendly-code-tinkering genomic tools written in Mathematica, and Cellarium is a programming language framework for bioinformatics workflows. The instructor taught evolutionary versions of this course in Departments of Biology, Computer Science, and Biochemistry and Cell Biology (in the Medical School).\nPre-requisite: CSCI 1810",
    "instructor": "Sorin Istrail",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1850",
    "title": "Deep Learning in Genomics",
    "url": "https://cs.brown.edu/courses/info/csci1850/",
    "description": "Deep learning models have achieved impressive performance in fields like computer vision and NLP. The collection of vast quantities of biological data naturally leads to the question -- can deep learning help us understand genomics? We will cover deep learning models like Auto-encoders and Convolutional Neural Networks and how have they been applied to solve problems in genomics. We will learn about different biological datasets, interpretation methods that help explain predictions, and what unique challenges are presented by the data in this field. Critical thinking and learning from the practical application of models to data are expected outcomes.",
    "instructor": "Ritambhara Singh",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1860",
    "title": "Cybersecurity Law and Policy",
    "url": "https://cs.brown.edu/courses/info/csci1860/",
    "description": "Course description: Cybersecurity and cyber conflict pose unique legal and policy challenges for governments, companies and citizens. The way those problems are resolved will shape the future of the internet. This course will examine cybersecurity as a legal and policy problem. How can government and society address network and computer insecurity while upholding privacy, civil liberties and other fundamental values?",
    "instructor": "Timothy H Edgar",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI1870",
    "title": "Cybersecurity Ethics",
    "url": "https://cs.brown.edu/courses/info/csci1870/",
    "description": "This timely, topical course offers a comprehensive examination of ethical questions in cybersecurity. These issues pervade numerous, diverse aspects of the economy and society in the Information Age, from human rights to international trade. Students will learn about these topics, beginning first with acquaintance with the dominant ethical frameworks of the 20th and 21st centuries, then employing these frameworks to understand, analyze, and develop solutions for leading ethical problems in cybersecurity. The things that you learn in this course will stay with you and inform your personal and professional lives.",
    "instructor": "Deborah Hurley",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI1880",
    "title": "Introduction to Computer Security",
    "url": "https://cs.brown.edu/courses/info/csci1880/",
    "description": "This course examines the basic principles of computer security for an organization, recognizing which system components relate to which principles. Additionally, the course covers methodologies and skills for making informed security decisions and understanding how to apply security principles to design security mechanisms while considering tradeoffs. Topics include general security principles, cryptography, authentication authorization, identity, and access management, operating systems security, network security, web security, and applications security. Throughout the course, you will develop a preliminary cybersecurity plan for an organization",
    "instructor": "Bernardo Palazzi\n          \n\n\n\n            Nikos Triandopoulos",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI1900",
    "title": "csciStartup",
    "url": "https://cs.brown.edu/courses/info/csci1900/",
    "description": "In csciStartup, you will incorporate and run a startup. Apply as a team to be part of a prototype class to remove the mystery from starting a company and to focus entirely on a product you're passionate about. We will learn by doing. Each team will incorporate, build a product for real customers, advertise their product, and improve it week after week. We'll spend at least half of our class meetings with individual attention to each group's progress and how to improve your offerings. Assignments will be designed to apply to any company, with enough flexibility to ensure you're always working on things that make sense for your business.",
    "instructor": "John H Jannotti",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-E",
    "title": "Human-Robot Interaction Seminar",
    "url": "https://cs.brown.edu/courses/info/csci1950-e/",
    "description": "Covers current research in Human-Robot Interaction. Course topics span the mechanical, computational, and empirical aspects of developing robot technology to improve human productivity and quality of life. Course participation includes presentation and analysis of research publications in Human-Robot Interaction and implementation of a group project. Prerequisites: CSCI 1410, 1480, or instructor permission.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-H",
    "title": "Computational Topology",
    "url": "https://cs.brown.edu/courses/info/csci1950-h/",
    "description": "We will study various algorithmic problems that arise in the study of topological phenomena, such as winding number, turning number, knot polynomials, topology of covering spaces (especially Riemann surfaces), and discrete Morse theory. The mathematical topics will be briefly introduced before we move to computations, but some a priori mathematical sophistication will make the course more valuable to the student. Prerequisite: CSCI 0160, 0180, or 0190",
    "instructor": "John F Hughes",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-I",
    "title": "Designing, Developing and Evaluating User Interfaces",
    "url": "https://cs.brown.edu/courses/info/csci1950-i/",
    "description": "This course has been renumbered and will be offered going forward as CSCI 1300.\nThis course will cover basis concepts in human-computer interaction including understanding how people view and interact with interfaces, what types of computer interfaces are practical and possible, modeling and representing user interaction, eliciting requirements and feedback from users, tools for prototyping and building interfaces, and user interface evaluation. The course will be primarily project-based and will involve a significant amount of design and evaluation. Prerequisites: CSCI 0150, 0180, or 0190; or permission of instructor.",
    "instructor": "Jeff Huang\n          \n\n\n\n            Steven P Reiss",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-N",
    "title": "2D Game Engines",
    "url": "https://cs.brown.edu/courses/info/csci1950-n/",
    "description": "2D Game Engines covers core techniques used in the development of the software that drives computer games and other interactive software. Projects involve building different varieties of 2D game engines as well as games that require use of the features implemented in the engines. Topics include high-level engine design, vector and raster graphics, animation, collision detection, physics, content management, and game AI. Prerequisite: CSCI 0160, 0180, or 0190. This course has also been offered as DISP CSCI1971. Students interested in an override should request on through Courses@Brown. Priority will be given to both seniors and juniors.",
    "instructor": "James H Tompkin",
    "meets": "TTh 6:40pm-8pm in CIT Center (Thomas Watson CIT) 101"
  },
  {
    "course code": "CSCI1950-Q",
    "title": "Programming for the Humanities and Social Sciences",
    "url": "https://cs.brown.edu/courses/info/csci1950-q/",
    "description": "A principled introduction to programming for students whose primary interest lies in the humanities and social sciences. Students will propose a substantial project related to their concentrations. They will learn sufficient programming skills to carry out the project, presenting it at the end of the course. The course is a continuation of CSCI 0931, 'Introduction to Computation for the Humanities and Social Sciences.'\nInstructor permission required.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            John F Hughes\n          \n\n\n\n            Steven P Reiss\n          \n\n\n\n            Shriram Krishnamurthi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-R",
    "title": "Compiler Practice",
    "url": "https://cs.brown.edu/courses/info/csci1950-r/",
    "description": "This class covers the practice of compiler writing, including lexical analysis, parsing, semantic analysis, code generation, and code optimization. Students design and implement a full compiler modularly for a modern functional language using a modern intermediate representation and modular backend.\nInstructor permission required",
    "instructor": "Shriram Krishnamurthi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-S",
    "title": "Fundamentals of Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci1950-s/",
    "description": "Covers the fundamental concepts, principles, and abstractions that underlie the design and engineering of computer systems. Topics include modularity, virtualization, communications, atomicity, fault tolerance, security, and performance. Combined lectures and presentation and discussion of case studies, influential papers as well as current literature for comparison and contrast. Several hands-on or written assignments. Prerequisities: CSCI 0310 and 0320, or permission of the instructor. Enrollment limited to 30.",
    "instructor": "Ugur Cetintemel",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-T",
    "title": "Advanced Animation Production",
    "url": "https://cs.brown.edu/courses/info/csci1950-t/",
    "description": "Students will apply knowledge and skills gained in previous animation courses to produce a high quality short animated film as a group. Production will follow the industry standard pipeline that includes modeling, texturing, lighting, animating, rendering, and post production. Interested students will perform preproduction story and concept design prior to beginning of course. Prerequisite: CSCI 1250. Enrollment limited to 15. Instructor permission required.",
    "instructor": "Barbara J. Meier",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-U",
    "title": "Topics in 3D Game Engine Development",
    "url": "https://cs.brown.edu/courses/info/csci1950-u/",
    "description": "Covers core techniques in 3D game development with an emphasis on engine architecture. Students independently develop their own engines using C++, OpenGL, and the Qt framework, then work in groups to create a polished game. Topics include: spatial subdivision, player representation, collision detection and response, game networking, GPUs, and OpenGL. Prerequisites: CSCI 1230 or knowledge of C++ and one of CSCI0300, CSCI0320, or CSCI0330 or equivalent experience. Enrollment limited to 25.",
    "instructor": "Daniel C Ritchie",
    "meets": "W 3pm-5:30pm in CIT Center (Thomas Watson CIT) 506"
  },
  {
    "course code": "CSCI1950-V",
    "title": "Advanced GPU Programming",
    "url": "https://cs.brown.edu/courses/info/csci1950-v/",
    "description": "This course explores the rapidly advancing field of GPU programming, leveraging the massive computational power of the GPU (Graphics Processing Unit) in applications both inside and outside its traditional role in the graphics pipeline. Topics include programming using C++, GLSL, and CUDA, as well as theoretical techniques for parallelizing algorithms to work in the GPU's unique execution structure. Prerequisite: CSCI 1230; CSCI 2240 will be helpful but not required. Familiarity with C and C++ is a must.",
    "instructor": "Andries van Dam",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-W",
    "title": "Topics in Data  Science",
    "url": "https://cs.brown.edu/courses/info/csci1950-w/",
    "description": "Data is the new soil of business and (soon) at the core of essentially all domains from material science to healthcare. Mastering big data not only requires skills in a variety of disciplines from distributed systems over statistics to machine learning, but also requires an understanding of a complex ecosystem of tools and platforms. This seminar will try to shed some light into the complex space of data science covering aspects from data management, distributed algorithms, virtualization, data mining, machine learning, and statistics. We will discuss how these techniques complement each other to make sense of data at massive scale. Prerequisites: CSCI 0320 and 1270, or equivalents, or instructor permission.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-X",
    "title": "Software Foundations",
    "url": "https://cs.brown.edu/courses/info/csci1950-x/",
    "description": "A project-based course focusing on the challenges and techniques involved in proving non-trivial properties about real-world systems.  We will base our exploration around formal development in a proof environment.  Roughly half of the course will be a guided tutorial of proof techniques using one or more theorem provers; in the remainder, students will apply this knowledge to existing systems.  No prior experience with theorem provers or proof assistants is necessary, but familiarity with and aptitude for functional programming will be a huge bonus.\nPrerequisities:  CSCI 1730 or equivalent, or permission of the instructor, mathematical maturity",
    "instructor": "Ben Lerner",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-Y",
    "title": "Logic for Systems",
    "url": "https://cs.brown.edu/courses/info/csci1950-y/",
    "description": "The course will focus on proving properties about systems and programs. We will study the distinction between programs and specifications, and check for whether the former obey the latter. We will work with tools that have extensive automation such as model constructors, model checkers, and proof assistants. Problems and projects will apply to real-world systems. Prerequisite: CSCI 0160, CSCI 0180, or CSCI 0190. Preferred but not required: CSCI 0220 and CSCI 0510, or instructor's permission.",
    "instructor": "Tim Nelson",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1950-Z",
    "title": "Computational Methods for Biology",
    "url": "https://cs.brown.edu/courses/info/csci1950-z/",
    "description": "This course focuses on algorithms and computational methods for problems arising in phylogenetics, functional genomics, and biological networks/systems biology.  Students will be introduced to the theory underlying each method, relying on techniques from graph theory, combinatorial optimization and machine learning.  In addition, students will learn how to apply these methods to real biological data.",
    "instructor": "Benjamin J Raphael",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-A",
    "title": "Data Science",
    "url": "https://cs.brown.edu/courses/info/csci1951-a/",
    "description": "Mastering big data requires skills spanning a variety of disciplines: distributed systems over statistics, machine learning, and a deep understanding of a complex ecosystem of tools and platforms. Data Science refers to the intersection of these skills and how to transform data into actionable knowledge. This course provides an overview of techniques and tools involved and how they work together: SQL and NoSQL solutions for massive data management, basic algorithms for data mining and machine learning, information retrieval techniques, and visualization methods.Prerequisites: CSCI 0160, CSCI 0180, CSCI 0190, or CSCI 0200. One of CSCI 0300, 0330, CSCI 0320, 1310 or 1330 strongly recommended.",
    "instructor": "Lorenzo De Stefani",
    "meets": "MW 3pm-4:20pm in Barus & Holley 166 (1/22 to 1/28)\nMW 3pm-4:20pm in MacMillan Hall 117 (1/29 to 5/16)"
  },
  {
    "course code": "CSCI1951-B",
    "title": "Virtual Citizens or Subjects? The Global Battle Over Governing Your Internet",
    "url": "https://cs.brown.edu/courses/info/csci1951-b/",
    "description": "The Internet began as a U.S. government research project, progressed to an open network run by free-spirited geeks, and transitioned in the late 1990s to a unique governance model in which nations, corporations, and civil society were supposed to all have a voice.  Suspicions abound that this model is nothing more than window dressing where the fate of the Internet is determined behind closed doors.  Where are the real decisions being made?  Who is making them?  How can you and citizens of other nations influence these decisions?  The global battle to run the Internet, brewing for years, has broken wide open with revelations of American spying on a massive scale.",
    "instructor": "Timothy Edgar",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-C",
    "title": "Designing Humanity Centered Robots",
    "url": "https://cs.brown.edu/courses/info/csci1951-c/",
    "description": "This semester we will explore how emerging technologies might shape our lives in the near future, as we design and build working prototypes. We will proceed from a set of questions that will complement a deep immersion in design process and creative practice. We will explore the “how” and “why” of designing new technologies. The course will help students build a portfolio of design projects that are in response to various design strategies such as Human Centered Design, Speculative Design, Critical Design, and Design Fiction, as well as developing skills for iterative prototyping and participatory critique.Students interested in registering should sign up here: https://docs.google.com/forms/d/e/1FAIpQLSdvo0o4ICpj55ZubZQTXdVRfBmnbCHbT8egriwPOcWcbRiy6A/viewform",
    "instructor": "Ian Gonsher",
    "meets": "MW 11am-1:50pm in Sciences Library 800"
  },
  {
    "course code": "CSCI1951-D",
    "title": "Projective Geometry via Interactive Proof Assistants",
    "url": "https://cs.brown.edu/courses/info/csci1951-d/",
    "description": "We will study both real and synthetic projective geometry, leading up to showing every Desarguesian projective plane admits coordinates in some division ring. We'll do all of this using an automated proof assistant, Lean, and learn something about logic and automated theorem proving at the same time. Does not fit any pathways, but certainly fits the \"Math/CS three additional courses in Math, CS, or related areas\" item.\nPrerequisites: (MATH 0520, 0540 or 1530) and (CSCI 0170, 0150 or 0190) and (CSCI 0160, 0180 or 1570) or minimum score of WAIVE in 'Graduate Student PreReq'.",
    "instructor": "John F Hughes",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-E",
    "title": "Computer Systems Security:  Principles and Practice",
    "url": "https://cs.brown.edu/courses/info/csci1951-e/",
    "description": "This course explores topics in computer systems security. It provides a concrete introduction to hardware, software, network and web security vulnerabilities and social engineering attacks. It also introduces principles designed to anticipate, assess and minimize security risks and examines a variety of techniques for passive and active defense and defense in depth. The course also explores the way advanced persistent threat campaigns are executed. The course will be team-taught.\nStudents who have previously taken CSCI 1660 should not take this course.\nPrerequisite: CSCI0330",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            John E Savage\n          \n\n\n\n            Anna A Lysyanskaya",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-G",
    "title": "Optimization Methods in Finance",
    "url": "https://cs.brown.edu/courses/info/csci1951-g/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-H",
    "title": "Software Security and Exploitation",
    "url": "https://cs.brown.edu/courses/info/csci1951-h/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "Vasileios Kemerlis",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-I",
    "title": "CS for Social Change",
    "url": "https://cs.brown.edu/courses/info/csci1951-i/",
    "description": "In this course, students will work in a studio environment to iteratively design, build, and test technical projects in partnership with different social change organizations. Students will be placed in small teams to collaboratively work on projects that will range from, for example, developing a chatbot to aid community engagement to building a mobile app to teach STEM to refugee kids. Through the course, we will also reflect on our positionality and ethics in engaging in social impact work and what it practically means to leverage technology to create social change on an everyday basis. Enrollment limited to 12. Entry to this course is through application only.",
    "instructor": "Lachlan Kermode",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-J",
    "title": "Interdisciplinary Scientific Visualization",
    "url": "https://cs.brown.edu/courses/info/csci1951-j/",
    "description": "Students will learn about solving scientific problems using computer graphics and visualization. Projects will involve the solution of scientific problems using computer graphics, modeling, and visualization. Working in small groups, students will identify scientific problems, propose solutions involving computational modeling and visualization, evaluate the proposals, design and implement the solutions, apply them to the problems, evaluate their success, and report on results. Example projects might include interactive software systems, immersive virtual reality cave applications, quantitative analysis tools, or new applications of existing visualizations methods. The focus will be on applications in the new virtual reality cave.\nInstructor permission required.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-L",
    "title": "Blockchains & Cryptocurrencies",
    "url": "https://cs.brown.edu/courses/info/csci1951-l/",
    "description": "Introduction to modern blockchain-based systems. Topics covered include consensus and distributed computing, examples cryptocurrencies, programming smart contracts, privacy and secrecy, transfer networks, atomic swaps and transactions, non-currency applications of blockchains, and legal and social implications. Students will do a programming project and a term project.",
    "instructor": "Maurice P Herlihy",
    "meets": "TTh 2:30pm-3:50pm in Salomon Center 003"
  },
  {
    "course code": "CSCI1951-M",
    "title": "Great Ideas in Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci1951-m/",
    "description": "Students will read and present major papers from across all areas of computer science in the last 70 years. The course is intended for sophomores and above who are interested in understanding how \"great ideas\" have driven vast and persevering shifts in computer science. While the tech industry constantly seeks the \"latest and greatest\", in this class we will instead seek to understand and identify enduring sources of value in the field, both past and future. Assignments include 2 paper presentations to the class, weekly short responses to papers, and a final project. The class is heavily discussion-based.",
    "instructor": "Paul A Valiant",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-N",
    "title": "VR+X, the Potential of Virtual Reality to Transform Nearly Everything",
    "url": "https://cs.brown.edu/courses/info/csci1951-n/",
    "description": "This course introduces students to the history, present, and future possibilities of virtual reality (VR) with a focus on addressing the question: What is the transformative potential of virtual reality? We’ll critically evaluate a variety of applications in fields as varied as healthcare, architecture, education, and storytelling. Students will learn discovery and design thinking processes of a kind that can lead to the development of VR solutions. Students will create a design concept for a VR use case in a field of their choosing.\nTo be added to the waitlist, please fill out the survey available here: https://goo.gl/forms/5g0xG2oQ9ssHFlF92",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-O",
    "title": "Design of Robotic Systems",
    "url": "https://cs.brown.edu/courses/info/csci1951-o/",
    "description": "Designing kinetic systems (i.e., systems that require movement or motion) relies on both mechanical and electrical engineering. These systems include everything from mobile robots used for rescue operation to electrically powered moving sculptures. Through a series of projects, students combine their knowledge of electronic circuit design, sensors, actuators, motors, microcontrollers, control theory and programming to build interactive art and robotic systems. Projects culminate in the design of a creative kinetic system that incorporates several of the principles learned in class. Some programming experience is helpful but not required. While there are no specific prerequisites for this course, it is assumed that students have some prior programming experience (e.g., CSCI111, 150, 170, ENGN30, 31, 32). Some prior digital system/circuit design, or robotics experience is also very helpful (e.g., ENGN500, ENGN520, ENGN1630, CSCI1951C, CSCI1951R), but not required.\nStudents interested in this course should register for ENGN-1931i",
    "instructor": "R. Iris Bahar",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-Q",
    "title": "Topics in Programming Languages",
    "url": "https://cs.brown.edu/courses/info/csci1951-q/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-R",
    "title": "Introduction to Robotics",
    "url": "https://cs.brown.edu/courses/info/csci1951-r/",
    "description": "Each student will learn to program a small quad-rotor helicopter. We will provide each student with their own robot for the duration of the course. The course will cover PID controllers for stable flight, localization with a camera, mapping, and autonomous planning. At the end of the course, the aim is for students to understand the basic concepts of a mobile robot and aerial vehicle.\nPlease add yourself to this waitlist if you are interested in enrolling: https://goo.gl/forms/ttm3ARhK47J7LaLI3\nInstructor permission required for registration",
    "instructor": "Stefanie A Tellex",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-S",
    "title": "Virtual Reality Software Review",
    "url": "https://cs.brown.edu/courses/info/csci1951-s/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-T",
    "title": "Surveying VR Data Visualization Software for Research",
    "url": "https://cs.brown.edu/courses/info/csci1951-t/",
    "description": "In a collaborative group effort, this course will search out, install, test, and critically evaluate VR software that supports data visualization for researchers. We will target several specific types of data, including volumetric data, and remote sensing data. We will investigate the capabilities of software for head-mounted displays (HMDs), big-metal displays like caves and the yurt, and, as a baseline, desktop displays. Software evaluation will include web research, hands-on case studies, and surveying. Results will be documented in a courses wiki.",
    "instructor": "David H. Laidlaw",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 101"
  },
  {
    "course code": "CSCI1951-U",
    "title": "Software Engineering of Large Systems",
    "url": "https://cs.brown.edu/courses/info/csci1951-u/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-V",
    "title": "Hypertext/Hypermedia: The Web Was Not the Beginning and the Web Is Not the End",
    "url": "https://cs.brown.edu/courses/info/csci1951-v/",
    "description": "Hypertext/Hypermedia systems -- first designed in the 1960s -- link information and people. Developed in the late 1980s, the Web was the first global hypermedia system; 30+ years later, it represents a small part of past visions. Students will identify still-uncommon features by exploring/using systems from the 1960s onwards. They will read papers for class discussion. They will study architecture and design topics such as annotating, note taking, searching, networking, collaboration, permanence, and social impact. Web programming projects, using TypeScript/MERN stack, will culminate in group projects to create their own hypertext/hypermedia systems.\nPrerequisites: An introductory CS sequence or equivalent experience\nTo be added to the waitlist, please go to https://forms.gle/YXqE4r1US53XiDU4A",
    "instructor": "Andries van Dam\n          \n\n\n\n            Norm Meyrowitz",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-W",
    "title": "Sublinear Algorithms for Big Data",
    "url": "https://cs.brown.edu/courses/info/csci1951-w/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-X",
    "title": "Formal Proof and Verification",
    "url": "https://cs.brown.edu/courses/info/csci1951-x/",
    "description": "Proof assistants are tools that are used to check the correctness of programs. Unlike tools like model checkers and SAT solvers, proof assistants are highly interactive. Machine-checked formal proofs lead to trustworthy programs and fully specified reliable mathematics. This course introduces students to the theory and use of proof assistants, using the system Lean. We will use Lean to verify properties of functional programs and theorems from pure mathematics. We will learn the theory of deductive reasoning and the logic that these tools are based on.Text: \"The Hitchhiker's Guide to Logical Verification\" by Blanchette et al.Prereqs: CSCI 1710 Logic for Systems or a proof-based mathematics course. Basic familiarity with functional programming (e.g. Haskell, ML) is helpful but not required.",
    "instructor": "Robert Y. Lewis",
    "meets": "MW 9:30am-10:50am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI1951-Y",
    "title": "The Robots are Coming! The Robots are Coming!",
    "url": "https://cs.brown.edu/courses/info/csci1951-y/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1951-Z",
    "title": "Fairness in Automated Decision Making",
    "url": "https://cs.brown.edu/courses/info/csci1951-z/",
    "description": "We know we want to build more equitable technology, but how? In this course we’ll review the latest developments in how to build more equitable algorithms, including definitions of (un)fairness, the challenges of explaining how ML works, making sure we can get accountability, and much more.",
    "instructor": "Suresh Venkatasubramanian",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-A",
    "title": "Human-AI Interaction",
    "url": "https://cs.brown.edu/courses/info/csci1952-a/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-B",
    "title": "Responsible Computer Science in Practice",
    "url": "https://cs.brown.edu/courses/info/csci1952-b/",
    "description": "What can ethics and social and political theory tell us about how to navigate the social impacts of computing? How do these perspectives shape technical decisions computer scientists have to make? The role of computer scientists is rapidly evolving: as the systems they build affect everyone, from individuals to society at large, computer scientists become more than just coders. They must be able to assess the social impacts of the technology they develop and engage with experts from other disciplines which offer critical insights and normative perspectives on those impacts. The goal of this course is to enable you to understand and critically reflect on key concepts and ideas in ethics and social and political theory on topics ranging from fairness to consent, digital well-being to regulation, and to apply them to concrete technical decisions in practical exercises and project-oriented work.",
    "instructor": "Julia Netter",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-C",
    "title": "Frontiers of Graph Algorithms Seminar",
    "url": "https://cs.brown.edu/courses/info/csci1952-c/",
    "description": "Graphs are one of the most powerful and flexible algorithmic tools. Likewise, graph algorithms remains a primary focus of modern algorithms research. This course will sample major results from contemporary paradigms of graph algorithms. Particular attention will be paid to techniques in graph sparsification and how these techniques have helped to recently solve open problems in algorithms. Planned topics include: metric embeddings, expander decompositions, iterative rounding, edge-degree-constrained subgraphs and graph shortcuts. This course is aimed at current and potential future graduate students considering proof-based research in algorithms. Each student will be responsible for reading and presenting a paper with the goal of better understanding how contemporary research in theoretical computer science is both done and best communicated.",
    "instructor": "Ellis Hershkowitz",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-I",
    "title": "Language Processing in Humans and Machines",
    "url": "https://cs.brown.edu/courses/info/csci1952-i/",
    "description": "Understanding language requires transforming sequences of sounds into words, combining words into meaningful thoughts, and incorporating thoughts into an ongoing discourse. Psychologists and linguists have been trying to reverse-engineer how humans do this so easily, at the speed of conversation. In parallel, computer scientists have been trying to engineer machines to solve the same problems, leading to products like Siri and Alexa. This class will explore how these two kinds of research can help each other, bringing recent insights from machine learning into the study of human language processing, and insights from human processing into the architectures of machine language systems. For CS students: Machine Learning, Deep Learning, Computational Linguistics (or comparable experience). For CLPS students: At least one of CLPS 0200, 0300, 0800, or 1800",
    "instructor": "Ellie Pavlick",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-L",
    "title": "Robotics and Choreography",
    "url": "https://cs.brown.edu/courses/info/csci1952-l/",
    "description": "This course explores overlapping concepts in the fields of robotics and choreography. Inspired by Boston Dynamics’ recent robotic dance performances, topics in this class will explore motion planning, inverse and forward kinematics, and robotic programming, as well as choreography, puppetry, dance history and theories of embodiment. Students will work on projects that aim to make robots dance in both real and simulated environments, as well foster research in the interstices of robotics and performance.",
    "instructor": "Stefanie A Tellex",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-Q",
    "title": "Robust Algorithms for Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci1952-q/",
    "description": "In this course, we will explore the theoretical foundations of machine learning and deep learning. We will focus on designing and analyzing machine learning algorithms with provable guarantees. More specifically, in this course we will (1) introduce basic tools in linear algebra and optimization, including the power method, singular value decomposition, matrix calculus, (matrix) concentration inequalities, and (stochastic) gradient descent, (2) cover many examples where one can design algorithms with provably guarantees for fundamental problems in machine learning (under certain assumptions), including topic modeling, tensor decomposition, sparse coding, and matrix completion, and (3) discuss the emerging theory of deep learning, including landscape analysis, generalization and over-parameterization, neural tangent kernels, generalization bounds, and implicit regularization.",
    "instructor": "Yu Cheng",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-R",
    "title": "Systems Transforming Systems",
    "url": "https://cs.brown.edu/courses/info/csci1952-r/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-V",
    "title": "Algorithms for the People",
    "url": "https://cs.brown.edu/courses/info/csci1952-v/",
    "description": "In this course we will examine how technology affects marginalized communities. In our analysis, we hope to better understand how power and identity affect the creation of technology, how these dynamics exclude marginalized groups, and the harmful consequences of this exclusion. This is a discussion-based seminar which will focus on the following themes: surveillance, protest movements, the technical needs of specific user groups, content moderation, and machine learning.",
    "instructor": "Lucy Qin, Kweku Kwegyir-Aggrey, Julia Netter",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1952-X",
    "title": "Contemporary Digital Policy and Politics",
    "url": "https://cs.brown.edu/courses/info/csci1952-x/",
    "description": "This course will examine the politics and processes for making policies related to the internet and digital policy issues. We will examine current issues at the national level, including the White House and federal agencies, Congress, international institutions and industry on issues such as privacy and information security, and on debates like whether and how to regulate Big Tech. Topics covered include the creation of national policies at the White House, the regulatory process, legislation, standards, global implications and the politics of technological change.Format and participation: This is an asynchronous version of IAPA 1811, available only to students enrolled in a completely online master’s degree program, by permission of the instructor. Students will complete weekly activities in lieu of attending synchronous class discussions.",
    "instructor": "Timothy H Edgar",
    "meets": "W 3pm-5:30pm Course offered online"
  },
  {
    "course code": "CSCI1952-Y",
    "title": "Computer Architecture",
    "url": "https://cs.brown.edu/courses/info/csci1952-y/",
    "description": "How does a computer program actually turn into the electrons moving inside of your computer? What are the relevant metrics and tradeoffs for designing a computer, and what impact do these tradeoffs have on our software? In this course, we cover computer organization and design, from a software lens. Topics include instruction set architectures, processor design and pipelining, memory hierarchies, program flow optimization, I/O, and emerging applications. Homeworks and final project will use powerful architecture simulators and explore general and specialized hardware for various applications.",
    "instructor": "Milda Zizyte",
    "meets": "MWF 10am-10:50am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI1952-Z",
    "title": "Robots as a Medium: Creating art with teams of robots",
    "url": "https://cs.brown.edu/courses/info/csci1952-z/",
    "description": "In this course, students will work in groups to use teams of flying and ground robots to create works of art, such as paintings, composing music, choreography, etc. This course is open to all concentrations, no prior experience necessary!",
    "instructor": "Eric A Ewing",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 316"
  },
  {
    "course code": "CSCI1953-A",
    "title": "Accessible and Inclusive Cybersecurity and Privacy",
    "url": "https://cs.brown.edu/courses/info/csci1953-a/",
    "description": "This seminar course will address the unique privacy and security challenges faced by select vulnerable communities (e.g., youth, refugees, survivors of gender-based violence, journalists, sex workers, etc.). Students will examine the technical foundations of security and privacy, pinpointing where they fail to provide holistic safety solutions. The course will blend theoretical knowledge with practical applications, covering inclusive design principles in cybersecurity and privacy, threat models for marginalized groups, societal and ethical considerations for security practices, and strategies for integrating inclusivity into security research, policymaking, and system design. Through readings, guest lectures, case studies, and collaborative projects, students will learn how to incorporate the needs of at-risk users into research and design. No prerequisites are required.",
    "instructor": "Diana Freed",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI1970",
    "title": "Individual Independent Study",
    "url": "https://cs.brown.edu/courses/info/csci1970/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1971",
    "title": "Independent Study in 2D Game Engines",
    "url": "https://cs.brown.edu/courses/info/csci1971/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI1972",
    "title": "Topics in 3D Game Engine Development",
    "url": "https://cs.brown.edu/courses/info/csci1972/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2000",
    "title": "Computer Science Research Methods",
    "url": "https://cs.brown.edu/courses/info/csci2000/",
    "description": "What does it mean to conduct research in computer science, and how might we be most effective at it? To help you begin a fruitful career in CS research, this class will cover the philosophy and practice of forming ideas, executing research, presenting outcomes, and more broadly understanding and contributing to our community. This class also aims to kick-start your time at Brown CS by being the 'missing semester' on how to be a PhD student, and by peeling back the curtain on why CS academia works like this to help you make the most of your time. Discussions will include: motivating, pitching, and funding research; finding, reading, and reviewing research; selecting research areas and forming hypotheses; designing, performing, and evaluating research; communicating research; research collaborations; and research ethics. We will learn together through presentations, activities, and discussions in class time, along with readings and assignments out of class.",
    "instructor": "James H Tompkin",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2002",
    "title": "Privacy and Personal Data Protection",
    "url": "https://cs.brown.edu/courses/info/csci2002/",
    "description": "If you tried to live for one day without generating any digital personal data, how would you spend it? In the Information Age, the use of personal data has proliferated and is pervasive. This course offers a comprehensive examination of protection of privacy and personal data, which is central to autonomy, dignity, and liberty. Topics include identity, financial, health, educational, and other data. Students will learn about: Fair Information Practices; the development of modern privacy rules in the United States and around the world; Fourth Amendment privacy and the autonomy of the individual in relation to the state; key US laws (HIPAA, FERPA, GLBA, GINA, COPPA, etc.); significant international rules (European Union’s General Data Protection Regulation (GDPR), etc.); important institutions (Federal Trade Commission, Data Protection Authorities, etc.); standards; Privacy by Design and Default; and emerging issues.",
    "instructor": "Deborah Hurley",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI2200",
    "title": "Cybersecurity Law and Policy",
    "url": "https://cs.brown.edu/courses/info/csci2200/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2222",
    "title": "Interpretability of Language Models",
    "url": "https://cs.brown.edu/courses/info/csci2222/",
    "description": "An outstanding problem in the field of deep learning is that neural networks are blackboxes – no one understands how they work “under the hood”. This class focuses on the extent to which we can understand and control such models, as well as review evidence that neural networks learn interpretable processes in their weights without direct supervision to do so. There will be an emphasis on interpretability of language models (LMs), although interpretability of vision models will also be touched upon when relevant. Topics covered will include causal interventions, probing, input attribution methods, and more recent topics in mechanistic interpretability. History and motivations for studying interpretability will also be discussed. The class will be a combination of reading and discussing research papers, and coding assignments that will culminate in a final project on a topic covered in class.",
    "instructor": "Ellie Pavlick\n          \n\nJack Merullo",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2230",
    "title": "Computer Graphics",
    "url": "https://cs.brown.edu/courses/info/csci2230/",
    "description": "This course offers an in-depth exploration of fundamental concepts in 2D and 3D computer graphics. It introduces 2D raster graphics techniques, including simple image processing. The bulk of the course is devoted to 3D modeling, geometric transformations, and 3D viewing and rendering. A sequence of assignments culminates in a simple geometric modeler and ray tracer. C++ and the graphics library OpenGL are used throughout the course, as is shader programming on the GPU. The final project is typically a small group project spec'd and implemented by the group using shaders or ray tracing to create special effects.",
    "instructor": "Daniel C Ritchie",
    "meets": "TTh 10:30am-11:50am in Smith-Buonanno Hall 106"
  },
  {
    "course code": "CSCI2240",
    "title": "Interactive Computer Graphics",
    "url": "https://cs.brown.edu/courses/info/csci2240/",
    "description": "CSCI 2240 explores several key areas of 3D graphics---rendering, geometry processing, optimization, and simulation---taking a sophisticated approach to each. This year, we are looking to improve the course's coverage of optimization by adding more lecture content on the topic (optimization theory, methods for solving (sparse) linear systems, etc.) and by designing a new assignment (likely 3D as-rigid-as-possible shape manipulation). Prerequisites: one of CSCI 0530, MATH 0520, MATH 0540; CSCI 1230; and familiarity with multivariable calculus by e.g. having taken one of MATH 180, MATH 200, MATH 350",
    "instructor": "Daniel C Ritchie",
    "meets": "MWF 11am-11:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI2270",
    "title": "Topics in Database Management",
    "url": "https://cs.brown.edu/courses/info/csci2270/",
    "description": "In-depth treatment of advanced issues in database management systems. Topics vary from year to year and may include distributed databases, mobile data management, data stream processing and web-based data management. Prerequisite: CSCI 1270.",
    "instructor": "Ugur Cetintemel\n          \n\n\n\n            Stanley B Zdonik",
    "meets": "M 12pm-2:20pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2300",
    "title": "Human-Computer Interaction Seminar",
    "url": "https://cs.brown.edu/courses/info/csci2300/",
    "description": "This seminar covers methods for conducting research in human-computer interaction (HCI). These topics will be pursued through independent reading, assignments, and class discussion. The seminar comprises four assignments that are designed to be meaningful and have the potential to be widely visible. We will have readings that teach HCI experimental research methods and provide examples of valuable contributions.\nThe goal of this course is to provide students the background necessary to perform research in HCI and the skills required to conduct human-centric research. There will little or no content in this course about user interfaces, but students will find topics in CSCI 1950i (User Interfaces) relevant.\nPrerequisites: Either CSCI 1300, CSCI 1950I or permission of the instructor.",
    "instructor": "Jeff Huang",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2310",
    "title": "Human Factors and User Interface Design",
    "url": "https://cs.brown.edu/courses/info/csci2310/",
    "description": "Covers current research issues in the implementation, evaluation and design of user interfaces, while also providing a basic background in user interface evaluation, programming, tools and techniques. A possible topic is programming and designing device-independent interfaces. Previous topics have included the development of pervasive Internet-based interfaces and software visualization. Prerequisite: consent of instructor.",
    "instructor": "Steven P Reiss",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2330",
    "title": "Programming Environments",
    "url": "https://cs.brown.edu/courses/info/csci2330/",
    "description": "Programming tools; control and data integration; software understanding and debugging; environments for parallel and distributed programming; reverse engineering; configuration management and version control and debugging. Emphasis on current research areas. Prerequisite: consent of instructor.",
    "instructor": "Steven P Reiss",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2340",
    "title": "Software Engineering",
    "url": "https://cs.brown.edu/courses/info/csci2340/",
    "description": "Topics in the design, specification, construction and validation of programs. Focus will be on tools to support each of these stages. Course will pay special attention to the concerns raised by the properties of modern software systems including distribution, security, component-based decomposition and implicit control. A basic software engineering course such as CSCI0320 or CSCI1340 or extensive industrial programming experience is required. Knowledge of system programming such as CSCI0300,CSCI0330, CSCI1310, or CSCI1330 is highly recommended.",
    "instructor": "Steven P Reiss",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2370",
    "title": "Interdisciplinary Scientific Visualization",
    "url": "https://cs.brown.edu/courses/info/csci2370/",
    "description": "Learn how to do research on using computer graphics, visualization, and interaction applied to scientific problems. Working in small multidisciplinary groups, students identify scientific problems, propose solutions involving computational modeling and visualization, design and implement the solutions, apply them to the problems, and evaluate their success.Prerequisites: programming experience, some graphics experience, problem ideas.",
    "instructor": "David H. Laidlaw",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2380",
    "title": "Distributed Systems With Laboratory",
    "url": "https://cs.brown.edu/courses/info/csci2380/",
    "description": "Explores the fundamental principles and practice underlying networked information systems, first we cover basic distributed computing mechanisms (e.g., naming, replication, security, etc.) and enabling middleware technologies. We then discuss how these mechanisms and technologies fit together to realize distributed databases and file systems, web-based and mobile information systems.",
    "instructor": "Nikos Vasilakis",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI2390",
    "title": "Privacy-Conscious Computer Systems",
    "url": "https://cs.brown.edu/courses/info/csci2390/",
    "description": "We will examine research papers on distributed system design, privacy-preserving, and secure computing techniques, and discuss how to apply these ideas in practice. The goal is to understand if, and how we can better protect the sensitive data we entrust to computer systems, both against leaks and against unauthorized or unethical use. We will look at web services, datacenter systems, distributed communication systems, and machine learning systems. During class, you will present and discuss papers, finish a set of hands-on assignments, work on a research project, and present your project at the end of the semester.",
    "instructor": "Malte Schwarzkopf\n          \n\nKinan Dak Albab",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2402-C",
    "title": "Reading the Large Language Models",
    "url": "https://cs.brown.edu/courses/info/csci2402-c/",
    "description": "Recent advances in Artificial Intelligence (AI) have produced systems that can appear human-level in their ability to generate text and images. This technology opens questions concerning the relationships between the art and philosophy of language and computation as cultural infrastructure. This seminar will explore how technology and humans interact via language, and what it means for humans and for AI to read and to write. The format of this collaborative humanities seminar will emphasize in-class discussion. Readings will comprise a mix of literature, including digital literature, theory, and philosophy of language. Participants will not be required to have a background in computer science or technology, but will experience tutorials on key technical concepts in order to enable them to think critically about cutting-edge developments in AI beyond a superficial level.",
    "instructor": "Ellie Pavlick\n          \n\nJohn Cayley",
    "meets": "Th 1pm-3:30pm in Andrews House 310"
  },
  {
    "course code": "CSCI2410",
    "title": "Statistical Models in Natural-Language Understanding",
    "url": "https://cs.brown.edu/courses/info/csci2410/",
    "description": "This course covers various topics in computer understanding of natural language, primarily from a statistical point of view. Topics include: hidden Markov models, word-tagging models, probabilistic context-free grammars, syntactic disambiguation, semantic word clustering, word-sense disambiguation, machine translation and lexical semantics. Prerequisite: CSCI1410.",
    "instructor": "Eugene Charniak",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2420",
    "title": "Probabilistic Graphical Models",
    "url": "https://cs.brown.edu/courses/info/csci2420/",
    "description": "Probabilistic graphical models provide a flexible framework for modeling large, complex, heterogeneous collections of random variables. After a brief introduction to their representational power, we provide a comprehensive survey of state-of-the-art methods for statistical learning and inference in graphical models. We discuss a range of efficient algorithms for approximate inference, including optimization-based variational methods, and simulation-based Monte Carlo methods. Several approaches to learning from data are explored, including conditional models for discriminative learning, and Bayesian methods for controlling model complexity. Programming experience required for homeworks and projects, which integrate mathematical derivations with algorithm implementations. PREREQUISITES: CSCI1420 or APMA1690.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2440",
    "title": "Advanced Algorithmic Game Theory",
    "url": "https://cs.brown.edu/courses/info/csci2440/",
    "description": "This course examines topics in game theory and mechanism design from a computer scientist’s perspective. Through the lens of computation, the focus is the design and analysis of systems utilized by self-interested agents. Students will investigate how the potential for strategic agent behavior can/should influence system design, and the ramifications of conflicts of interest between system designers and participating agents. Emphasis on computational tractability is paramount, so that simple designs are often preferred to optimal. Students will learn to analyze competing designs using the tools of theoretical computer science, and empirical tools, such as empirical game-theoretic analysis. Application areas include computational advertising, wireless spectrum, and prediction markets.",
    "instructor": "Amy R Greenwald",
    "meets": "W 3pm-5:30pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI2450",
    "title": "Exchange Scholar Program",
    "url": "https://cs.brown.edu/courses/info/csci2450/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2470",
    "title": "Deep Learning",
    "url": "https://cs.brown.edu/courses/info/csci2470/",
    "description": "Deep Learning belongs to a broader family of machine learning methods. It is a particular version of artificial neural networks that emphasizes learning representation with multiple layers of networks. Deep Learning, plus the specialized techniques that it has inspired (e.g. convolutional neural networks, recurrent neural networks, and transformers), have led to rapid improvements in many applications, such as computer vision, machine learning, sound understanding, and robotics. This course gives students an overview of the prominent techniques of Deep Learning and its applications in computer vision, language understanding, and other areas. It also provides hands-on practice of implementing deep learning algorithms in Python. A final project will implement an advanced piece of work in one of these areas. Students may take CSCI 2470 or CSCI 1470 but not both.",
    "instructor": "Chen Sun",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 165"
  },
  {
    "course code": "CSCI2500-A",
    "title": "Advanced Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2500-a/",
    "description": "In this course, we study a selection of advanced algorithms and data structures that are provably correct and fast.  Our goal is to present a broad range of algorithmic ideas and techniques, especially those that have had significant impact on the field and/or have had or might have practical impact.  Prerequisite: CSCI 1570 or the equivalent",
    "instructor": "Philip Klein",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2500-B",
    "title": "Optimization Algorithms for Planar Graphs",
    "url": "https://cs.brown.edu/courses/info/csci2500-b/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "Philip Klein",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2500-C",
    "title": "Graph Theory and Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2500-c/",
    "description": "Graphs (a.k.a. networks) are ubiquitous in computer science. Moreover, algorithmic problems on graphs have played a singular role in the development of theoretical computer science, e.g. the notions of polynomial time and of linear time and of NP-completeness.  This course focuses on those aspects of graph theory that are most relevant to algorithms, on the classical algorithmic developments that have shaped the field, and on some emerging algorithmic methods that show promise of theoretical or practical impact.",
    "instructor": "Philip Klein",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2510",
    "title": "Approximation Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2510/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2520",
    "title": "Computational Geometry",
    "url": "https://cs.brown.edu/courses/info/csci2520/",
    "description": "Algorithms and data structures for fundamental geometric problems in two and three dimensions. Topics include point location, range searching, convex hull, intersection, Voronoi diagrams and graph drawing. Applications to computer graphics, circuit layout, information visualization and computer-aided design are also discussed. Prerequisite: CSCI1570 or written permission.",
    "instructor": "Roberto Tamassia",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2531",
    "title": "Internet and Web Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2531/",
    "description": "This advanced graduate course/seminar focuses on the mathematical foundations of algorithms for handling large amounts of data over networks.  We'll read and discuss recent papers in information retrieval, search engines, link analysis, probabilistic modeling of the web and social networks, and more.  Prerequisites:  CSCI1550 and CSCI1570, or equivalent courses.",
    "instructor": "Eli Upfal",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2540",
    "title": "Advanced Probabilistic Methods in Computer Science",
    "url": "https://cs.brown.edu/courses/info/csci2540/",
    "description": "Advanced topics in applications of probabilistic methods in design and analysis of algorithms, in particular to randomized algorithms and probabilistic analysis of algorithms. Topics include the Markov chains Monte Carlo method, martingales, entropy as a measure for information and randomness, and more. Prerequisite: CSCI 1450. Recommended but not required: CSCI 1570.",
    "instructor": "Eli Upfal",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2550",
    "title": "Parallel Computation: Models, Algorithms, Limits",
    "url": "https://cs.brown.edu/courses/info/csci2550/",
    "description": "The theoretical foundations of parallel algorithmics. Analysis of the most important models of parallel computation, such as directed-acyclic computation graphs, shared memory and networks, and standard data-exchange schemes (common address space and message-passing). Algorithmic techniques with numerous examples are cast mostly in the data-parallel framework. Finally, limitations to parallelizability (P-completeness) are analyzed. The content of the course is likely to change as technology evolves. Written permission required for undergraduates.",
    "instructor": "Franco Preparata",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2560",
    "title": "Advanced Complexity",
    "url": "https://cs.brown.edu/courses/info/csci2560/",
    "description": "Advanced topics in computational complexity, such as:  the polynomial hierarchy, interactive proofs, pseudorandomness, derandomization, probabilistically checkable proofs.",
    "instructor": "Anna A Lysyanskaya",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2570",
    "title": "Introduction to Nanocomputing",
    "url": "https://cs.brown.edu/courses/info/csci2570/",
    "description": "Nanoscale technologies employing materials whose smallest dimension is on the order of a few nanometers are expected to replace lithography in the design of chips. We introduce to computational nanotechnologies and explore problems presented by their stochastic nature. Nanotechnologies based on the use of DNA and semiconducting materials are explored. Prerequisite: CSCI0510.",
    "instructor": "John E Savage",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2580",
    "title": "Solving Hard Problems in Combinatorial Optimization: Theory and Systems",
    "url": "https://cs.brown.edu/courses/info/csci2580/",
    "description": "Addresses not only the theory of combinatorial optimization but also how it is embodied in practical (industrial and logistical) systems. Explores some of the issues and obstacles encountered in implementing such systems. Emphasizes the wide variety of techniques and methodologies available, including integer programming, local search, constraint programming, and approximation algorithms. Problems addressed may include: scheduling, coloring, traveling salesman and resource allocation. Prerequisites: CSCI0320 or CSCI0360, and basic knowledge of linear algebra.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2590",
    "title": "Advanced Topics in Cryptography",
    "url": "https://cs.brown.edu/courses/info/csci2590/",
    "description": "Seminar-style course on advanced topics in cryptography. Example topics are zero-knowledge proofs, multi-party computation, extractors in cryptography, universal composability, anonymous credentials and ecash, interplay of cryptography and game theory. May be repeated for credit. Prerequisite: CSCI 1510 or permission of the instructor.",
    "instructor": "Anna A Lysyanskaya",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2660",
    "title": "Computer Systems Security",
    "url": "https://cs.brown.edu/courses/info/csci2660/",
    "description": "This course teaches computer security principles from an applied viewpoint and provides hands-on experience with security threats and countermeasures. The course additionally covers principles and skills useful for making informed security decisions and for understanding how security interacts with the world around it. The main topics covered are cryptography, authentication, access control, web security, and network security. Other topics include cybersecurity ethics and privacy. The course aims to balance theory and practice. These advanced versions focus on real-world skills: performing attacks that are more difficult and rely on less serious vulnerabilities, and creating attacks that achieve a higher standard of quality than a mere ”proof of concept.” This course covers the same material as CSCI 1620 and 1660 and shares their assignments. Graduate students only. If you are interested in this course, request an override and fill out this form: https://forms.gle/pHPAy9ntQkAQ7xLD9",
    "instructor": "Bernardo Palazzi\n          \n\n\n\n            Nikos Triandopoulos",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 368"
  },
  {
    "course code": "CSCI2670",
    "title": "Operating Systems",
    "url": "https://cs.brown.edu/courses/info/csci2670/",
    "description": "Covers not just the principles of operating systems but the intricacies of how they work. Topics include multithreaded programming, managing threads and interrupts, managing storage, processor scheduling, operating-system structure, virtualization, security, and the design of file systems (both local and distributed). Extensive examples are taken from actual systems, including Linux and Windows. Students are expected to complete both problem sets and programming assignments (in C) and will individually write a simple operating system. Prerequisite: one of CSCI 0300, CSCI 0330, CSCI 1310, or CSCI 1330. Graduate students only. This course covers the same material as the combination of CSCI 1670 and 1690 and shares their assignments.",
    "instructor": "Thomas W Doeppner\n          \n\n\n\n            Malte Schwarzkopf",
    "meets": "MWF 2pm-2:50pm in Metcalf Research Building AUD"
  },
  {
    "course code": "CSCI2680",
    "title": "Computer Networks and the Internet",
    "url": "https://cs.brown.edu/courses/info/csci2680/",
    "description": "The Internet is ubiquitous today — you are using it right now! To understand it, we will read and discuss both classical and recent research papers on computer networking, including the design, structure, and technical history of the Internet, and we will consider the implications on both the design of other computer systems, as well as on Internet applications. We will study topics including routing, content delivery, transport algorithms, datacenter networks, edge networks, and Internet-scale applications. During class students will present and discuss papers. Assignments will include written paper summaries and reviews, as well as a semester-long research project. Students will present their projects at the end of the semester.",
    "instructor": "Akshay Narayan",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2690",
    "title": "Datacenter and Cloud Operating Systems",
    "url": "https://cs.brown.edu/courses/info/csci2690/",
    "description": "Most of the large-scale web applications and enterprise applications we use daily rely on datacenters for compute, storage, networking and security, commonly via cloud computing interfaces. There are many research questions around how to use the datacenter as a computing platform to architect the “best” applications, all while datacenter hardware is rapidly evolving. This is a graduate-level seminar on cloud and datacenter operating systems. We will study topics such as serverless computing, kernel bypass operating systems, tiered and far memory systems, hardware accelerators, and disaggregation. The goals of the class are to (1) learn about the challenges surrounding cloud and datacenter systems, (2) practice reading, analyzing, and presenting systems research papers on these topics, and (3) perform a semester-long research project and present findings to the class.",
    "instructor": "Deepti Raghavan",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 101"
  },
  {
    "course code": "CSCI2730",
    "title": "Programming Language Theory",
    "url": "https://cs.brown.edu/courses/info/csci2730/",
    "description": "Theoretical models for the semantics of programming languages and the verification of programs. Topics will be drawn from operational semantics, denotational semantics, type theory and static analyses.  Prerequisite: CSCI1730, CSCI 1950Y, or permission of the instructor.",
    "instructor": "Shriram Krishnamurthi\n          \n\nT. Stephen Strickland",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2750",
    "title": "Topics in Parallel & Distributed Computing",
    "url": "https://cs.brown.edu/courses/info/csci2750/",
    "description": "CSCI2750 considers an advanced topic (to be determined) in distributed computing. May be repeated for credit. Written permission needed for undergraduates.",
    "instructor": "Maurice P Herlihy",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2810",
    "title": "Advanced Computational Molecular Biology",
    "url": "https://cs.brown.edu/courses/info/csci2810/",
    "description": "High-throughput experimental approaches now allow molecular biologists to make large-scale measurements of DNA, RNA, and protein, the three fundamental molecules of the cell. The resulting datasets are often too large for manual analysis and demand computational techniques. This course introduces algorithms for sequence comparison and alignment; molecular evolution and phylogenetics; DNA/RNA sequencing and assembly; recognition of genes and regulatory elements; and RNA and protein structure. The course demonstrates how to model biological problems in terms of computer science. CSCI 0160, 0180, 0190, or 0200. Recommended: CS 220, or some other course that introduces concepts from discrete math and probability. Course overrides are available at the instructor’s discretion.",
    "instructor": "Sorin Istrail",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2820",
    "title": "Algorithmic Foundations in Computational Biology",
    "url": "https://cs.brown.edu/courses/info/csci2820/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "Sorin Istrail",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2840",
    "title": "Advanced Algorithms in Computational Biology and Medical Bioinformatics",
    "url": "https://cs.brown.edu/courses/info/csci2840/",
    "description": "Devoted to computational problems and methods in the emerging field of Medical Bioinformatics where genomics, computational biology and bioinformatics impact medical research. We will present challenging problems and solutions in three areas: Disease Associations, Protein Folding and Immunogenomics. This course is open to graduate students and advanced undergraduates with Computational or Life Science backgrounds. Prior background in Biology is not required.",
    "instructor": "Sorin Istrail",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2890",
    "title": "Comprehensive Examination Preparation",
    "url": "https://cs.brown.edu/courses/info/csci2890/",
    "description": "For graduate students who have met the tuition requirement and are paying the registration fee to continue active enrollment while preparing for a preliminary examination.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-C",
    "title": "Algorithms for Cancer Genomics",
    "url": "https://cs.brown.edu/courses/info/csci2950-c/",
    "description": "This graduate seminar will explore algorithmic challenges that emerge in the analysis and interpretation of cancer genome sequencing data, with a focus on two major themes.  The first theme is the mutational process of cancer evolution.  The underlying algorithmic problem is to construct trees that represent the relationships between cells from mutational data.  We will explore tree reconstruction algorithms using phylogenetic techniques (perfect phylogeny and Dollo parsimony) and population genetic techniques (branching processes and the coalescent).  The second theme is the identification of combinations of cancer causing mutations.  Such combinations typically result from biological interactions between genes, which are represented via graphs, or networks.  We will examine algorithms to analyze data on graphs including random walks (e.g. PageRank), diffusion processes, community detection, and spectral methods for graph partitioning.  The course will be organized in seminar style where students will read and present recent research papers and complete a class project.",
    "instructor": "Benjamin J Raphael",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-E",
    "title": "Stochastic Optimization",
    "url": "https://cs.brown.edu/courses/info/csci2950-e/",
    "description": "This advanced graduate course/seminar focuses on optimization under uncertainty, or optimization problems where some of the constrains include random (stochastic) components. Most practical optimization problems are stochastic (subject to future market conditions, weather, faults, etc.), and there has been substantial research (both theoretical and experimental) in efficient solution for such problems. We discuss some of the recent work in this area.",
    "instructor": "Eli Upfal",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-G",
    "title": "Large-Scale Networked Systems",
    "url": "https://cs.brown.edu/courses/info/csci2950-g/",
    "description": "We explore widely distributed systems that take advantage of resources throughout the Internet. These systems leverage their large size and geographic diversity to provide bandwidth scalability, rapid responses, fault tolerance, high availability and diverse data collection. The course is based on the critical discussion of (mostly) current papers drawn from recent conferences. Projects involve simulation/implementation and performance evaluation.",
    "instructor": "John H Jannotti",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-J",
    "title": "Cognition, Human-Computer Interaction and Visual Analysis",
    "url": "https://cs.brown.edu/courses/info/csci2950-j/",
    "description": "In this graduate seminar we will learn about models of human cognition and perception, and explore potential implications of the models on how computers and humans can interact effectively when performing scientifica analyses.  Participants will be responsible for reading assigned materials, taking turns guiding discussions of the readings, and preparing a final paper and presentation.  It is recommended that participants have some background in at least one of the areas of study.",
    "instructor": "David H. Laidlaw",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-K",
    "title": "Special Topics in Computational Linguistics",
    "url": "https://cs.brown.edu/courses/info/csci2950-k/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-L",
    "title": "Medical Bioinformatics: Disease Associations, Protein Folding and Immunogenomics",
    "url": "https://cs.brown.edu/courses/info/csci2950-l/",
    "description": "This course is devoted to computational problems and methods in the emerging field of Medical Bioinformatics where genomics, computational biology and bioinformatics impact medical research. We will present challenging problems and solutions in three areas: Disease Associations, Protein Folding and Immunogenomics.\nGenome-wide disease association studies (GWAS) present major computational challenges. The goal is to identify inherited genetic variation and its critical role in human disease. Huge datasets containing billions of SNPs, such as the Multiple Sclerosis Consortium GWAS data, will be a subject of our investigations. We will also discuss GWAS analyses for type 2 diabetes (common variants) and mental diseases (rare variants).\nThe computational protein folding problem, the classical grand challenge of biotechnology, can be stated as follows: can we computationally predict the 3-D native structure of a protein from its 1-D amino acid sequence? Lattice models of protein folding, although unrealistic, contain longstanding unsolved combinatorial and algorithmic problems of exceeding difficulty. Alzheimer's disease has been linked to protein (mis)folding.\nDo pathogens evolve their proteomes to avoid the surveillance of the human immune system? Killer T-cells, the 'special forces' of the human immune system, travel throughout the body and eliminate cells that 'display' on their surfaces short pieces of pathogen proteins, called epitopes that are difficult to computationally predict. We will search for epitopes in the immunopeptidomes of H. sapiens, M. musculus, D. melanogaster, HIV, vaccinia, herpesviruses and M. tuberculosis.\nThis course is open to graduate students and advanced undergraduates with Computational or Life Science backgrounds. Prior background in Biology is not required.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-O",
    "title": "Topics in Brain-Computer Interfaces",
    "url": "https://cs.brown.edu/courses/info/csci2950-o/",
    "description": "Introduces the mathematical and computational foundations of brain-computer interfaces. Statistical learning, Bayesian inference, dimensionality reduction, information theory and other topics are presented in the context of brain interfaces based on neural implants. Prerequisites: Knowledge of probability, statistics and linear algebra (e.g., CSCI1550, APMA0410, APMA1650, or APMA1690). Enrollment limited to 20 students.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-P",
    "title": "Special Topics in Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci2950-p/",
    "description": "This seminar course explores current research topics in statistical machine learning.  Focus varies by year, and may include Bayesian nonparametrics; models for spatial, temporal, or structured data; and variational or Monte Carlo approximations.  Course meetings combine lectures with presentation and discussion of classical and contemporary research papers.  Students will apply some of this material to a project, ideally drawn from their own research interests.",
    "instructor": "Erik B Sudderth",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-Q",
    "title": "Topics in Computer Vision",
    "url": "https://cs.brown.edu/courses/info/csci2950-q/",
    "description": "This course will cover corrent topics in computer vision by focusing on a single real problem in computer vision.  Recent courses have focused on forensic video analysis of an unsolved murder and three-dimensional object recognition for a mobile robot.  Readings from the literature are integrated with group projects to solve problems beyond the state of the art.  Strong mathematical skills (probability, linear algebra, calculus) and previous exposure to computer vision (e.g. CSCI1430) are essential.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-R",
    "title": "Special  Topics in Advanced Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2950-r/",
    "description": "Planar graphs arise in applications such as road map navigation and logistics, graph drawing, and image processing. Our focus will be on recent research results for classical problems that exploit planarity, for example: Traveling Salesperson, Shortest Paths, and Maximum Flow. We will also cover the data structures that are used by these algorithms, for example: Dynamic Trees.",
    "instructor": "Philip Klein",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-T",
    "title": "Topics in Distributed Databases & Systems",
    "url": "https://cs.brown.edu/courses/info/csci2950-t/",
    "description": "Explores data and resource management issues that arise in the design, implementation and deployment of networked systems by covering the state of the art in research and industry. Typical topics include cloud computing and sensor networks.   Strongly recommended: CSCI 0320, CSCI 1270, or CSCI 1951A.\nInstructor permission required for registration.",
    "instructor": "Ugur Cetintemel\n          \n\n\n\n            Carsten Binnig",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-U",
    "title": "Special Topics on Networking and Distributed Systems",
    "url": "https://cs.brown.edu/courses/info/csci2950-u/",
    "description": "Explores current research topics in networking, distributed and operating systems. Specific topics may include wireless and sensor networking, Internet-scale distributed systems, cloud computing, as well as the core problems, concepts, and techniques underlying these systems. The course has two components: reading and discussion of current and classical research papers, and a research project related to the topic but ideally drawn from students' own research interests.\nThis is a graduate-level course, undergrads can join with the consent of the instructor.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-V",
    "title": "Topics in Applied Cryptography",
    "url": "https://cs.brown.edu/courses/info/csci2950-v/",
    "description": "This course surveys recent developments in applied cryptography. Research in this field is motivated by privacy and security issues that arise in practice from areas like cloud computing, databases, surveillance and finance. Topics will vary each year.\nPrerequisite:  CSCI 1660 required; CSCI 1510 strongly recommended.",
    "instructor": "Seny F Kamara",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-W",
    "title": "Online Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2950-w/",
    "description": "Decisions must often be made before the entire data is available.  Online algorithms solve problems in which commitments must be made as the data is arriving.  Choosing which items to evict from a cache before knowing future requests, which advertisers to consider for displaying ads alongside the result of a search, or which most representative data to store when computing statistics about a huge stream of information.   We will discuss worst-case model, which hinges against the worst possible future data, and some stochastic and game-theoretic models.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-X",
    "title": "Topics in Programming Languages & Systems",
    "url": "https://cs.brown.edu/courses/info/csci2950-x/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2950-Z",
    "title": "Robot Learning and Autonomy",
    "url": "https://cs.brown.edu/courses/info/csci2950-z/",
    "description": "This seminar course covers current research topics related to perceiving and acting in the real world. These topics will be pursued through independent reading, class discussion, and project implementations. Papers covered will be drawn from robotics, computer vision, animation, machine learning, and neuroscience. Special emphasis will be given to developing autonomous control from human performance. No prerequisites.",
    "instructor": "Chad Jenkins",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-A",
    "title": "Robots for Education",
    "url": "https://cs.brown.edu/courses/info/csci2951-a/",
    "description": "This seminar will explore the potential for robotics to engage future generations of scientists and engineers, with a particular focus on broadening participation in computing across society. Academic papers describing existing models, systems, courses, and evaluation for teaching robotics at undergraduate and secondary levels will be covered through students presentations. A group project will be conducted to find viable and accessible 'off-the-shelf' technology solutions suited to teaching robotics without requiring a technical background. Instructor permission required.",
    "instructor": "Chad Jenkins",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-B",
    "title": "Data-Driven Vision and Graphics",
    "url": "https://cs.brown.edu/courses/info/csci2951-b/",
    "description": "Investigates current research topics in image-based graphics and vision. We will examine data sources, features, and algorithms for understanding and manipulating visual data. We will pay special attention to methods that use crowd-sourcing or Internet-derived data. Vision topics such as scene understanding and object detection will be linked to graphics applications such as photo editing and image-based rendering. These topics will be pursued through independent reading, class discussion and presentations, and a semester long research project. Strong mathematical skills and previous imaging (vision or computational photography) courses are essential.",
    "instructor": "James H Hays",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-C",
    "title": "Autonomous Agents and Computational Market Design",
    "url": "https://cs.brown.edu/courses/info/csci2951-c/",
    "description": "An important area of research in artificial intelligence is how to effectively automate decision making in time-critical, information-rich environments. Electronic markets are a prime example of such environments. In this course students will create their own simulated electronic market as well as autonomous agents that trade in their market simulation. Application domains will include supply chain management, the Dutch flower auctions, and ad auctions, such as those run by Google and Facebook.",
    "instructor": "Amy R Greenwald",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-D",
    "title": "Topics in Information Retrieval and Web Search",
    "url": "https://cs.brown.edu/courses/info/csci2951-d/",
    "description": "Covers traditional material as well as recent advances in information retrieval (IR), the study of indexing, processing, and querying of textual data. The focus will be on newer techniques geared to hypertext documents available on the World Wide Web. Topics include efficient text indexing; Boolean and vector space retrieval models; evaluation and interface issues; Web crawling, link-based algorithms, and Web metadata; text/Web clustering, classification; text mining.",
    "instructor": "Eli Upfal",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-E",
    "title": "Topics in Computer System Security",
    "url": "https://cs.brown.edu/courses/info/csci2951-e/",
    "description": "This course explores advanced computer security and privacy and highlights current research in the area. Topics include applications security, applied cryptography, cloud security, operating systems security, software security, web security, usable security, and vulnerabilities and defenses in cyber-physical systems (e.g., automotive, medical, and industrial control devices). Recent research papers will be presented and discussed, and projects will provide an opportunity for creative work. Class attendance is required, and active participation in class discussions is essential. The course can be used to satisfy the capstone requirement for the ScB degree in Computer Science. Instructor permission is required to register.",
    "instructor": "Roberto Tamassia",
    "meets": "W 3pm-5:30pm Course offered online"
  },
  {
    "course code": "CSCI2951-F",
    "title": "Learning and Sequential Decision Making",
    "url": "https://cs.brown.edu/courses/info/csci2951-f/",
    "description": "The course explores automated decision making from a computer-science perspective. It examines efficient algorithms, where they exist, for single agent and multiagent planning as well as approaches to learning near-optimal decisions from experience. Topics will include Markov decision processes, stochastic and repeated games, partially observable Markov decision processes, and reinforcement learning. Of particular interest will be issues of generalization, exploration, and representation. Participants should have taken a graduate-level computer science course and should have some exposure to machine learning from a previous computer-science class or seminar; check with instructor if not sure. Recommended Prerequisites: CSCI 1950F or CSCI 1420",
    "instructor": "Ronald Parr",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-G",
    "title": "Computational Protein Folding",
    "url": "https://cs.brown.edu/courses/info/csci2951-g/",
    "description": "This course investigates the challenges of protein folding from an algorithmic perspective. A mixture of lectures, discussions, and demonstrations is targeted at computer science graduate students (and advanced undergrads) with an interest in biology and physics but no prior experience necessary; students from other departments with expertise in the subject are welcome. This course is forward-looking, and aims to get students rapidly up to speed to conduct research projects.",
    "instructor": "Paul A Valiant",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-H",
    "title": "Algorithms for Big Data",
    "url": "https://cs.brown.edu/courses/info/csci2951-h/",
    "description": "As advances in technology allow for the collection and storage of vast amounts of data, the task of efficiently analyzing the data and assessing the significance of the discoveries has become a major challenge in algorithms design. This graduate course/seminar deals with algorithmic tools and techniques for the organization, manipulation and processing of large amounts of data. This course focuses on mathematically well founded algorithmic and statistical techniques.",
    "instructor": "Eli Upfal",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-I",
    "title": "Computer Vision for Graphics and Interaction",
    "url": "https://cs.brown.edu/courses/info/csci2951-i/",
    "description": "Computer vision reconstructs real world information from image and video data; computer graphics synthesizes dynamic virtual worlds; interaction lets us explore these worlds; and machine learning allows us to map between domains across vision, graphics, and interaction. In visual computing, these fields converge to exploit both models of visual appearance and databases of examples to generate and interact with new images. This enables applications from the seemingly simple, like semantic photo editing, to the seemingly science fiction, like mixed reality. In this seminar, we will discover the state-of-the-art algorithmic contributions in computer vision which make this possible. Please join us!",
    "instructor": "James H Tompkin",
    "meets": "MW 3pm-4:20pm in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2951-J",
    "title": "Topics in Advanced Algorithmics:  Algorithmic Game Theory, 3D Computational Geometry, Quantum Computing",
    "url": "https://cs.brown.edu/courses/info/csci2951-j/",
    "description": "The first half of the course will be on the following topics, connecting computer science to economics: introduction to mechanism design, combinatorial auctions, computational efficiency in mechanisms, profit maximization, distributed aspects, cost sharing, and online mechanisms.\nThe second half of the course consists of two topics in algorithmic theory:  3D-computational geometry, its model and foundations, convex hulls, intersection,  proximity; introduction to quantum computing, foundations, networks, notable algorithms, and a critical review.\nThere will be one numerical grade for each half of the course, then the two grades will be reconciled by the two instructors into a final letter grade.\nEach student can choose whether they want a letter grade or prefer S/NC. First class will be held on WEDNESDAY, January 23rd.",
    "instructor": "Franco Preparata",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-K",
    "title": "Topics in Collaborative Robotics",
    "url": "https://cs.brown.edu/courses/info/csci2951-k/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-L",
    "title": "Human-Computer Interaction Seminar",
    "url": "https://cs.brown.edu/courses/info/csci2951-l/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-M",
    "title": "Advanced Algorithms Seminar",
    "url": "https://cs.brown.edu/courses/info/csci2951-m/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-N",
    "title": "Advanced Algorithms in Computational Biology",
    "url": "https://cs.brown.edu/courses/info/csci2951-n/",
    "description": "This is a full-lecture, graduate course on algorithms and biomedical applications. The Foundations lectures are an introduction to the biological and medical genomics application areas. Each Algorithm section is devoted to an algorithmic method presented in rigorous depth, followed by an important open problem in the application area, together with the current most effective algorithmic solutions to the problem. Graduate students and advanced undergraduates in computational and mathematical sciences and engineering are welcome. Biological, life sciences and medical students and faculty are welcome as well and will be able to participate more in the applications areas.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-O",
    "title": "Foundations of Prescriptive Analytics",
    "url": "https://cs.brown.edu/courses/info/csci2951-o/",
    "description": "We are undoubtedly in the middle of an Analytics Revolution that enabled turning huge amounts data into insights, and insights into predictions about the future. At its final frontiers, Prescriptive Analytics is aimed at identifying the best possible action to take given the constraints and the objective. To that end, this course provides students with a comprehensive overview of the theory and practice of how to apply Prescriptive Analytics through optimization technology. A wide variety of state-of-the-art techniques are studied including: Boolean Satisfiability, Constraint Programming, Linear Programming, Integer Programming, Local Search Meta-Heuristics, and Large-Scale Optimization. Pre Requisites: One of CSCI 0300, 0320, CSCI 0330, CSCI 1310, OR CSCI 1330 and recommended: one of CSCI 0530, CSCI 1570, MATH 0520 or MATH 0540.",
    "instructor": "Serdar Kadioglu",
    "meets": "F 3pm-5:30pm in CIT Center (Thomas Watson CIT) 316"
  },
  {
    "course code": "CSCI2951-P",
    "title": "Human-Robot Interaction Seminar",
    "url": "https://cs.brown.edu/courses/info/csci2951-p/",
    "description": "This course covers current research in Human-Robot Interaction.  Course topics span the mechanical, computational, and empirical aspects of developing robot technology to improve human productivity and quality of life.  Course participation includes presentation and analysis of research publications in Human-Robot Interaction and implementation of a group project.  Prerequisites:  CSCI 1410, or CSCI 1430, or CSCI 1480, or instructor permission.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-Q",
    "title": "Topics in  Advanced Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2951-q/",
    "description": "Students in this course will read, present, and discuss recent papers papers on sublinear time algorithms, with a focus on the 'big data' question: what is the least amount of data needed to solve our problem? We will discuss property testing, streaming algorithms, and machine learning approaches. This course is aimed at current and potential future graduate students who want to gain technical depth and perspective on the field of algorithms. The papers will be different from those covered in 2951M, which will be offered every other year\nPrerequisites: an undergraduate algorithms course (CS157 or equivalent) and mathematical maturity",
    "instructor": "Paul A Valiant",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-R",
    "title": "Personal Informatics Seminar",
    "url": "https://cs.brown.edu/courses/info/csci2951-r/",
    "description": "Data science for data about you. Computing is expanding our ability to collect and process data about our everyday lives. This seminar covers personal informatics, the collection of data from daily activities for reflection and self-experimentation. We will cover methods for knowing more about yourself through using technology to track different types of data and how to interpret them, and run controlled experiments on yourself. We will learn about behavioral analytics, experimental design, time-series analysis and apply them to domains of health, productivity, travel, wellness. These topics will be pursued through independent reading, exercises, class discussion, and a semester-long self-tracking and experimentation project. Students should already be comfortable working programmatically with data, and preferably taken a course in: data science, machine learning, user interfaces, or probability/statistics. The seminar will have limited enrollment. Please see http://cs.brown.edu/courses/csci2951-r/ for details, and fill out http://goo.gl/forms/3pejazvbo6 to apply if interested.\nPrerequisites:  One of:  CSCI 1300, CSCI 2300, CSCI 1951A, CSCI 1420, CSCI 1450, or instructor permission",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-S",
    "title": "Distributed Computing through Combinatorial Topology",
    "url": "https://cs.brown.edu/courses/info/csci2951-s/",
    "description": "In the past decade, exciting new techniques have emerged for analyzing distributed and concurrent systems and algorithms. These new techniques are based on notations adapted from topology, a field of mathematics concerned with properties of objects that are innate, in the sense of being preserved by continuous deformations such as stretching or twising. In particular, we use ideas adapted from *combinatorial topology*, a branch of topology that focuses on discrete constructions.\nAlthough computer science itself is based on discrete mathematics, combinatorial topology and its applications may still be unfamiliar to many computer scientists.  For this reason, this course provides a self-contained, elementary introduction to the concepts from combinatorial topology needed to analyze distributed computing. Conversely, while the systems and models used here are standard in computer science, they may be unfamiliar to students with a background in pure or applied mathematics. For this reason, this course also provides a self-contained, elementary description of standard notions of distributed computing.\nPrerequisites:  CSCI 1760 recommended",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-T",
    "title": "Data-Drive Computer Vision",
    "url": "https://cs.brown.edu/courses/info/csci2951-t/",
    "description": "Investigates current research topics in data-driven object detection, scene recognition, and image-based graphics. We will examine data sources, features, and algorithms useful for understanding and manipulating visual data. We will pay special attention to methods that harness large-scale or Internet-derived data. There will be an overview of the current crowdsourcing techniques used to acquire massive image datasets. Vision topics such as scene understanding and object detection will be linked to graphics applications such as photo editing. These topics will be pursued through independent reading, class discussion and presentations, and projects involving current research problems in Computer Vision.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-U",
    "title": "Topics in Software Security",
    "url": "https://cs.brown.edu/courses/info/csci2951-u/",
    "description": "This course investigates the state-of-the-art in software exploitation and defense. Specifically, the course is structured as a seminar where students present research papers to their peers. We will begin with a summary of prevalent software defects, typically found in applications written in memory unsafe languages, and proceed to surveying what we are up against: traditional and modern exploitation techniques, ranging from classical code injection and code reuse up to the newest goodies (JIT-ROP, Blind ROP). For the bulk part, we will focus on the latest advances in protection mechanisms, mitigation techniques, and tools against modern vulnerability classes and exploitation methods.",
    "instructor": "Vasileios Kemerlis",
    "meets": "M 3pm-5:30pm in CIT Center (Thomas Watson CIT) 101"
  },
  {
    "course code": "CSCI2951-V",
    "title": "Systems for Interactive Data Exploration",
    "url": "https://cs.brown.edu/courses/info/csci2951-v/",
    "description": "Enabling visual data exploration at ``human speed'' is key to democratizing data science and maximizing human productivity. Unfortunately, traditional data management systems or more recent analytical frameworks, like Hadoop and Spark, are ill-suited for that purpose.  Similar current machine learning algorithms and other analytical techniques are not designed for returning fast progressive answer.\nThe goal of this research seminar is to study recently proposed techniques to make data exploration over large data sets more interactive, participate in the development of the next generation of interactive data exploration systems and through it make a active research contribution.\nPrerequisites:  One of CSCI 0320, CSCI 0330; and one of CSCI 1270, CSCI 1951-A, CSCI 1670",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-W",
    "title": "Creative Artificial Intelligence for Computer Graphics",
    "url": "https://cs.brown.edu/courses/info/csci2951-w/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-X",
    "title": "Reintegrating AI",
    "url": "https://cs.brown.edu/courses/info/csci2951-x/",
    "description": "The goal of AI has been to build complete intelligent agents, yet the field has been fragmented into a collection of problem-specific areas of study. We will first spend a few weeks in lecture covering a new approach to integrating existing AI subfields into a single agent architecture, and remainder of the semester on self-directed, semester-long research projects.Grading based on a mid-semester project proposal, and a substantial open-ended final project. The projects will be multi-disciplinary in nature but students will have the opportunity to work in small groups, so they need not necessarily have expertise in the relevant areas. Graduate students welcome; undergraduates need instructor permission to enroll.",
    "instructor": "George D Konidaris",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 506"
  },
  {
    "course code": "CSCI2951-Y",
    "title": "Special Topics in Formal Semantics and Notional Machines",
    "url": "https://cs.brown.edu/courses/info/csci2951-y/",
    "description": "The course will bridge two hitherto separate but deeply related areas of investigation on the behavior of programs. Formal semantics arise from the programming languages community while notional machines arise from computer science education; both provide a description of program behavior and enable static reasoning. We will assume a background in programming language semantics, and view the notional machines proposed in the literature through this lens to identify their strengths and weaknesses. The rest should be a catalog of how we can improve both notational machines and formal semantics.",
    "instructor": "Shriram Krishnamurthi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2951-Z",
    "title": "Advanced Algorithmic Game Theory",
    "url": "https://cs.brown.edu/courses/info/csci2951-z/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-A",
    "title": "Blockchains and Cryptocurrencies",
    "url": "https://cs.brown.edu/courses/info/csci2952-A/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-B",
    "title": "Topics in Computer Science Education Research",
    "url": "https://cs.brown.edu/courses/info/csci2952-b/",
    "description": "The course will cover a variety of topics in the field of computer science education research. Foundational topics include qualitative and quantitative methods, learning sciences, applied cognitive science, and study design. Specialized topics include notional machines, assessment, paradigms, tools, environments, and misconceptions. There will be extensive readings as well as projects.\nPrerequisites:  CSCI 1730, CSCI 1950Y, or CLPS 2906",
    "instructor": "Shriram Krishnamurthi",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-C",
    "title": "Learning with Limited Labeled Data",
    "url": "https://cs.brown.edu/courses/info/csci2952-c/",
    "description": "As machine learning is deployed more widely, researchers and practitioners keep running into a fundamental problem: how do we get enough labeled data? This seminar course will survey research on learning when only limited labeled data is available. Topics covered include weak supervision, semi-supervised learning, active learning, transfer learning, and few-shot learning. Students will lead discussions on classic and recent research papers, and work in teams on final research projects.\nPrevious experience in machine learning is required through CSCI1420 or equivalent research experience.",
    "instructor": "Stephen Bach",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-D",
    "title": "Computational Semantics",
    "url": "https://cs.brown.edu/courses/info/csci2952-d/",
    "description": "Natural language understanding is a holy grail of AI. And with the machine learning advancing at such a rapid pace, breakthroughs in automatic language understanding seem to be just around the corner. But what exactly are the current barriers in automating human-like language capabilities? This course will dissect what makes language understanding so challenging, including both theoretical aspects (logic, formal semantics, pragmatics, knowledge representation) and practical methods (graphical models, game theory, neural networks). The course will be project-based, and will emphasize reading and critiquing current research in computer science, linguistics, and cognitive science. \nPre-requisites:  CSCI 1420 or CSCI 1460",
    "instructor": "Ellie Pavlick",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-E",
    "title": "Topics in Network Management: Data-driven and Programmable Networks",
    "url": "https://cs.brown.edu/courses/info/csci2952-e/",
    "description": "This class explores the broader theme of understanding the design principles for architecting reliable, secure, and performance networking infrastructures for cloud platforms, big data analytics, IoT, and etc. We will examine the implication of various network paradigms, e.g., programmable data planes or data-driven networking, on the design of next-generation network infrastructures. The goal is to touch upon relevant dimensions in the design space and extract key lessons for designing large-scale infrastructure. The class will cover key enabling technologies in network management (e.g., NFV, programmable data planes, eBPF), and application use-cases driving adopt of these techniques.",
    "instructor": "Theophilus A Benson",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-F",
    "title": "Distributed Systems at Scale: Microservices Management",
    "url": "https://cs.brown.edu/courses/info/csci2952-f/",
    "description": "This seminar investigates and explores cutting edge challenges and issues in the emerging Microservices paradigm. Microservices are a specific cloud paradigm for enabling distributed systems and applications at scale. In particular, this course builds on the foundations provided by the initial distributed systems, networking and operating systems offering (i.e., CSCI 1380, CSCI 1680, CSCI 1670) and explores how these concepts are used to realize, manage, and orchestrate microservices. The course is driven by materials from academic conferences and industrial blogs. The industrial blogs will provide context and motivation for different problems. The academic reasons will provide a deep divide into the technical details: we will focus on reading, analyzing, critiquing and brainstorming academic papers. Students taking this class should be familiar with reading academic literature, performing critical analysis, and working on open ended problems with undefined solutions. More information: http://cs.brown.edu/courses/info/csci2952-f/",
    "instructor": "Theophilus A Benson",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-G",
    "title": "Deep Learning in Genomics",
    "url": "https://cs.brown.edu/courses/info/csci2952-g/",
    "description": "Deep learning models have achieved impressive performance in fields like computer vision and NLP. Given an adequate amount of data, these models can extract meaningful representations to perform accurate predictions. The collection of vast quantities of biological data naturally leads to the question -- can deep learning help us understand genomics? In this seminar-style class, we will cover the recent research literature trying to answer this question. We will learn how state-of-the-art models like CNNs, RNNs, GCNs, GANs, etc. have been applied to solve significant problems in genomics and what unique challenges are presented by the data in this field.",
    "instructor": "Ritambhara Singh",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 219"
  },
  {
    "course code": "CSCI2952-H",
    "title": "Recent Progress in Reinforcement Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-h/",
    "description": "Reinforcement learning is a framework for studying machines that interact with a sequential environment to achieve a goal. In the past decade, the RL framework has gained a lot of attention owing to its intriguing success in solving problems in complicated domains such as games, robotics, and dialog systems. We observe continual growth in the number of RL papers published in major machine-learning conferences. This growth calls for a careful investigation of the recent progress in the field. By reading selections of the current RL literature, this graduate-level course examines some of the latest theoretical and empirical progress in the field.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-I",
    "title": "Language Processing in Humans and Machines",
    "url": "https://cs.brown.edu/courses/info/csci2952-i/",
    "description": "Understanding language requires transforming sequences of sounds into words, combining words into meaningful thoughts, and incorporating thoughts into an ongoing discourse. Psychologists and linguists have been trying to reverse-engineer how humans do this so easily, at the speed of conversation. In parallel, computer scientists have been trying to engineer machines to solve the same problems, leading to products like Siri and Alexa. This class will explore how these two kinds of research can help each other, bringing recent insights from machine learning into the study of human language processing, and insights from human processing into the architectures of machine language systems. For CS students: Machine Learning, Deep Learning, Computational Linguistics (or comparable experience). For CLPS students: At least one of CLPS 0200, 0300, 0800, or 1800",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-J",
    "title": "Computing with Emerging Technology",
    "url": "https://cs.brown.edu/courses/info/csci2952-j/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-K",
    "title": "Topics in 3D Computer Vision and Deep Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-k/",
    "description": "We live in a world that spans 3 dimensions. Cameras and sensors image the 3D world by projecting to a 2D plane. How can we recover the 3D world back from these images? What techniques can we use to process 3D data? In this course we will study computer vision and machine learning techniques to recover 3D information of the world from images, and process and understand 3D data. We will learn about classical computer vision techniques but focus on cutting-edge deep learning methods. The techniques we will study are widely used, for instance, in self-driving cars and smartphone AR face filter apps.",
    "instructor": "Srinath Sridhar",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 241"
  },
  {
    "course code": "CSCI2952-L",
    "title": "Special Topics in Secure Computation",
    "url": "https://cs.brown.edu/courses/info/csci2952-l/",
    "description": "Nowadays, vast amounts of individual data are collected by numerous entities, which may contain sensitive private information. Due to regulatory compliance or corporate policies, securely computing on the collected data in a privacy-preserving way becomes more urgent than ever. Secure computation achieves the above goal, providing great promise and potential to facilitate research in various domains. This course will introduce the students to secure computation, at the end of which students will gain a good knowledge of both the theoretical foundations and practical implementations of secure computation. Students will be able to understand cryptography research papers and initiate research studies in this or related areas. Recommended prerequisite: CSCI1570 or equivalent.",
    "instructor": "Peihan Miao",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-M",
    "title": "The Works that Made and Changed Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-m/",
    "description": "This seminar is aimed at current and potential future graduate students who want to gain technical depth and perspective on the field of statistical machine learning. Students will read, present, and discuss some of the original papers that had a transformative impact on the development of machine learning. Topics will range from mathematical foundations, to major algorithmic, and breakthrough works on deep learning and its applications in vision and NLP. Ideal students will have a mix of: 1) motivation to learn how to read, present and evaluate technical papers, 2) mathematical maturity and basic ML background, 3) willingness to participate and contribute to discussions. Enrollment will be limited, and will be finalized after the first class. No formal prerequisite.",
    "instructor": "Eli Upfal",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-N",
    "title": "Advanced Topics in Deep Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-n/",
    "description": "Prepares graduate students with the knowledge they need to apply Deep Learning techniques for their own research. There has been tremendous success in developing unified neural architectures that achieve state-of-the-art performance on language understanding (GPT-3), visual perception (ViT), and even protein structure prediction (AlphaFold). We plan to understand how they work, and how the success of such unified models can give rise to further developments on self-supervised learning, a technique that trains machine learning models without requiring labeled data; and multimodal learning, a technique that utilizes multiple input sources, such as vision, audio, and text. We will study recent attempts to interpret these models, thus revealing potential risks on model bias. Paper reading, student presentations, and invited guest lectures. Students required to work on a final project that explores a novel direction along the line of the papers we cover.",
    "instructor": "Chen Sun",
    "meets": "TTh 1pm-2:20pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2952-O",
    "title": "A Practical Introduction to Advanced 3D Robot Perception",
    "url": "https://cs.brown.edu/courses/info/csci2952-o/",
    "description": "This course is aimed at preparing graduate students and senior undergrads to do advanced work at the intersection of two important and popular fields: computer vision and robotics. The course will focus on the latest advances through lectures, readings, and discussion groups. The lectures and readings will be designed to represent a mix of classical techniques as well as the most recent advances in the two fields. The unique highlight of this course is the inclusion of a practical component: students will implement a project that combines computer vision and robotics by using cameras and a real robot arm. Students will form teams for this project and have exclusive access to a camera and a small robot arm both of which can be interfaced with the students' laptops. Pre-reqs: One of CSCI 1430, CSCI 1470, CSCI 1951R, CSCI 1230.",
    "instructor": "Srinath Sridhar",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-P",
    "title": "Coordinated Mobile Robotics",
    "url": "https://cs.brown.edu/courses/info/csci2952-p/",
    "description": "Mobile robotics has made a large impact in our lives, from how we satisfy our consumerism to how we fight wars. Thousands of warehouse robots autonomously zip around each other in a highly structured and specialized environment that makes coordination look easy, while military robots are often teleoperated by more than one person, making coordination difficult. Moving beyond highly controlled scenarios presents many challenges. Most importantly, mobile robots will interact in complex environments with other robots and people. How can we ensure robots safely do what we want them to do? What are the ethical ramifications of multirobot systems? In this course, we study the past, present, and future of coordinated mobile robotics, including a discussion of ethics. The majority of this course is a seminar-style survey of issues and approaches for control and coordination in multi-robot systems.",
    "instructor": "Nora Ayanian",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-Q",
    "title": "Robust Algorithms for Machine Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-q/",
    "description": "As machine learning systems start to make more important decisions in our society, we need learning algorithms that are reliable and robust. In this course, we will (1) cover basic tools in linear algebra, matrix calculus, and statistics that are useful in theoretical machine learning, (2) explore different adversarial models and examine whether existing algorithms are robust in these models, and (3) design and analyze provably robust algorithms for fundamental tasks in machine learning. In particular, we will focus on the research areas of high-dimensional robust statistics, non-convex optimization, learning with strategic agents, and spectral graph theory. This is a research-oriented course where students are asked to read and present sophisticated papers in top machine learning conferences. Knowledge of basic linear algebra, algorithms, data structures, probability and statistics is essential. Prior experience with machine learning is required.",
    "instructor": "Yu Cheng",
    "meets": "M 3pm-5:30pm in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2952-R",
    "title": "Systems Transforming Systems",
    "url": "https://cs.brown.edu/courses/info/csci2952-r/",
    "description": "The subject of the seminar is the development of new techniques, tools, and systems for automatically augmenting existing software systems with new capabilities — including, but not limited to, parallelism, distribution, isolation, and security. Τhe seminar will have a dual focus: 60% on advanced scientific topics in systems and 40% on academic communication, especially technical writing. These two foci will be structured as overlapping layers — systems in the foreground, technical communication in the background. A key goal will be for students, working in teams of 4–5 members, to develop papers worthy of scientific publication; as such, the course is structured around projects designed carefully, and with appropriate support, to result in paper publications in the systems community.",
    "instructor": "Nikos Vasilakis",
    "meets": "W 3pm-5:30pm in Salomon Center 003"
  },
  {
    "course code": "CSCI2952-S",
    "title": "Topics in Cyber and Digital Policy",
    "url": "https://cs.brown.edu/courses/info/csci2952-s/",
    "description": "This online asynchronous course explores advanced topics in cybersecurity and digital policy, including privacy and civil liberties. Research papers and/or projects will provide an opportunity for creative work. Topics may include public policy and the international aspects of cybersecurity, legislation and legal requirements concerning digital policy issues, the history and background of privacy and civil liberties in information and information systems, cyber conflict, and related subjects.There is no set class time. Students and the instructor will coordinate work online and over Zoom through periodic meetings.CSCI 1800, 1860, 1805, 1870 or equivalent background is a prerequisite. Instructor permission required.",
    "instructor": "Timothy H Edgar",
    "meets": "Course offered online"
  },
  {
    "course code": "CSCI2952-T",
    "title": "An Algorithmist's Toolkit",
    "url": "https://cs.brown.edu/courses/info/csci2952-t/",
    "description": "Doing research in theory and algorithms is often inaccessible because it requires an eclectic mathematical toolkit that is spread over many areas. The goal of this course is to consolidate many of these tools into a single course. Namely, this course will equip students with a mathematical foundation that will allow them to jumpstart their own theory research, particularly in algorithms. The course will cover not only many of the recurring mathematical tools in algorithms but also the ways in which these tools are used to design algorithms with rigorous guarantees. It is intended mainly for early-stage theory graduate students and advanced undergraduates. Some planned topics include polyhedral methods, metric embeddings, techniques from graph theory and the multiplicative weights framework.",
    "instructor": "Ellis Hershkowitz",
    "meets": "TTh 9am-10:20am in CIT Center (Thomas Watson CIT) 477"
  },
  {
    "course code": "CSCI2952-U",
    "title": "Beyond Worst Case Analysis of Algorithms",
    "url": "https://cs.brown.edu/courses/info/csci2952-u/",
    "description": "The theoretical study of algorithms and data structures has focused mostly on worst-case analysis, where we prove bounds on the running time, space, approximation ratio, competitive ratio, or other measure that holds even in the worst case. More and more, however, the limitations of worst-case analysis become apparent and create new challenges. In practice, we often do not face worst-case scenarios, and the question arises of how we can tune our algorithms to work even better on the kinds of instances we are likely to see, while ideally keeping a rigorous formal framework of analysis. In this graduate seminar course, we will review several alternatives to worst-case analysis, developed largely in the theoretical computer science literature over the past 20 years, and their most notable algorithmic applications. Subjects include: parametrized analysis, instance optimality, semirandom models, smoothed analysis, comparative analysis, and",
    "instructor": "Eli Upfal",
    "meets": "TTh 2:30pm-3:50pm in CIT Center (Thomas Watson CIT) 316"
  },
  {
    "course code": "CSCI2952-V",
    "title": "Algorithms for the People",
    "url": "https://cs.brown.edu/courses/info/csci2952-v/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2952-W",
    "title": "Critical Data and Machine Learning Studies",
    "url": "https://cs.brown.edu/courses/info/csci2952-w/",
    "description": "In this course, we will investigate the complex ways that data and machine learning technologies are shaped by human values, social processes, and power structures. We will engage with 1) foundational social theory, exploring concepts such as situated knowledge, participation, intersectionality, decoloniality, positionality, and refusal and 2) recent research that bridges these concepts with modern machine learning & AI technology and practice. Students will develop both critical and imaginative ways of thinking: understanding how to situate technology in its sociotechnical context, while building alternative and more just futures. The course will introduce different research methodologies and applications areas relevant to scholars in this interdisciplinary space. Students will complete reading reflections, class discussions, and a final project engaging with the course themes.",
    "instructor": "Harini Suresh",
    "meets": "TTh 10:30am-11:50am in CIT Center (Thomas Watson CIT) 101"
  },
  {
    "course code": "CSCI2952-X",
    "title": "Research Topics in Self Supervised Learning",
    "url": "https://cs.brown.edu/courses/info/csci2952-x/",
    "description": "We will cover the core components of current self supervised learning pipelines: (i) data preprocessing, (ii) data augmentation, (iii) optimization, and (iv) fine-tuning. For each, we will read and discuss recent papers and work in group to implement our own alternative solutions.",
    "instructor": "Randall Balestriero",
    "meets": "MWF 1pm-1:50pm in CIT Center (Thomas Watson CIT) 165"
  },
  {
    "course code": "CSCI2952-Y",
    "title": "Special Topics in Computational Design and Fabrication",
    "url": "https://cs.brown.edu/courses/info/csci2952-y/",
    "description": "N/A",
    "instructor": "N/A",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2955",
    "title": "The Design and Analysis of Trading Agents",
    "url": "https://cs.brown.edu/courses/info/csci2955/",
    "description": "The Dutch Flower Auctions (DFA) clear over 100,000 auctions per day, each lasting on average between 3 and 5 seconds!  This semester, we'll study the mechanism through which the DFA distribute 2/3 of the world's flowers, focusing on both the sellers' and buyers' decision-making processes.  More generally, we'll research ways to automate and optimize decision-making in time-critical, information-rich environments, like the DFA.\nStudents who obtained permission from the instructor or completed CSCI0190 or CSCI0150&CSCI0160 or CSCI0170&CSCI0180 can register for the course. CSCI1410 is a co-requisite.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2956-F",
    "title": "Machine Learning Reading Group",
    "url": "https://cs.brown.edu/courses/info/csci2956-f/",
    "description": "A weekly informal discussion of topics within the concentration of machine learning. Topics covered include graphical models, Bayesian estimation, dynamical systems, unsupervised/semi-supervised learning, etc.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2980",
    "title": "Reading and Research",
    "url": "https://cs.brown.edu/courses/info/csci2980/",
    "description": "Computer Science at Brown University\n    Providence, Rhode Island 02912 USA\n    Phone: 401-863-7600\nMap & Directions /\n    Contact Us",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2990",
    "title": "Thesis Preparation",
    "url": "https://cs.brown.edu/courses/info/csci2990/",
    "description": "For graduate students who have met the residency requirement and are continuing research on a full time basis.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "CSCI2999-A",
    "title": "Cybersecurity Management Within Business, Government, and Non-Profit Organizations",
    "url": "https://cs.brown.edu/courses/info/csci2999-a/",
    "description": "For the most up to date information on this class, please visit this page: https://cs.brown.edu/courses/csci2999-a/ CSCI 2999A will put you in the shoes of decision-makers working in business, government, and non-profit sectors so that you can gain experience grappling with real-world management problems through thought exercises and thoughtful reflection. I anticipate that the course will feature guest speakers that will help you learn unique insights. Content is designed to strengthen your skills as both a cybersecurity practitioner and leader. By examining real events that organizations have faced, you will practice and refine your ability to evaluate the challenges that arise for organizational leaders.",
    "instructor": "Ernesto Zaldivar",
    "meets": "M 3pm-5:30pm in CIT Center (Thomas Watson CIT) 506"
  },
  {
    "course code": "DATA0080",
    "title": "Data, Ethics and Society",
    "url": "https://cs.brown.edu/courses/info/data0080/",
    "description": "A course on the social, political, and philosophical issues raised by the theory and practice of data science. Explores how data science is transforming not only our sense of science and scientific knowledge, but our sense of ourselves and our communities and our commitments concerning human affairs and institutions generally. Students will examine the field of data science in light of perspectives provided by the philosophy of science and technology, the sociology of knowledge, and science studies, and explore the consequences of data science for life in the first half of the 21st century. Fulfills requirement for Certificate in Data Fluency.",
    "instructor": "Deborah Hurley",
    "meets": "N/A"
  },
  {
    "course code": "DATA0200",
    "title": "Data Science Fluency",
    "url": "https://cs.brown.edu/courses/info/data0200/",
    "description": "As data science becomes more visible, are you curious about its unique amalgamation of computer programming, statistics, and visualizing or storytelling? Are you wondering how these areas fit together and what a data scientist does? This course offers all students regardless of background the opportunity for hands-on data science experience, following a data science process from an initial research question, through data analysis, to the storytelling of the data. Along the way, you will learn about the ethical considerations of working with data, and become more aware of societal impacts of data science. Course does not count toward CS concentration requirements.\nPrerequisites: CSCI 0111, 0150, 0170, 0190, CLPS 0950, 1292 or minimum score of WAIVE in 'Graduate Student PreReq'.",
    "instructor": "Linda Clark",
    "meets": "N/A"
  },
  {
    "course code": "DATA1030",
    "title": "Hands-on Data Science",
    "url": "https://cs.brown.edu/courses/info/data1030/",
    "description": "Develops all aspects of the machine learning pipeline: data acquisition and cleaning, handling missing data, exploratory data analysis, visualization, feature engineering, modeling, interpretation, presentation in the context of real-world datasets. Fundamental considerations for data analysis are emphasized (the bias-variance tradeoff, training, validation, testing). Classical models and techniques for classification and regression are included (linear and logistic regression with regularization, support vector machines, decision trees, random forests, XGBoost). Uses the Python data science ecosystem (e.g., sklearn, pandas, numpy, matplotlib). \nPrerequisites: A course equivalent to CSCI 0050, CSCI 0150 or CSCI 0170 are strongly recommended.Enrollment is limited to Data Science Master's program students.",
    "instructor": "Andras Zsom",
    "meets": "N/A"
  },
  {
    "course code": "DATA1050",
    "title": "Data Engineering",
    "url": "https://cs.brown.edu/courses/info/data1050/",
    "description": "The course will cover the storage, retrieval, and management of various types of data and the computing infrastructure (such as various types of databases and data structures) and algorithmic techniques (such as searching and sorting algorithms) and query languages (such as SQL) for interacting with data, both in the context of transaction processing (OLTP) and analytical processing (OLAP). Students will be introduced to measures for evaluating the efficacy of different techniques for interacting with data (such as ‘Big-Oh’ measure of complexity and the number of I/O operations) and various types of indexes for the efficient retrieval of data. The course will also cover several components of the Hadoop ecosystem for the processing of ‘big data.’ Additional topics include cloud computing and NoSQL databases. Introduction to some of the concepts and techniques of computer science essential for data science will also be covered.\nInstructor permission required.",
    "instructor": "Shekhar Pradhan",
    "meets": "N/A"
  },
  {
    "course code": "DATA2040",
    "title": "Deep Learning",
    "url": "https://cs.brown.edu/courses/info/data2040/",
    "description": "A hands-on introduction to neural networks, reinforcement learning, and related topics. Students will learn the theory of neural networks, including common optimization methods, activation and loss functions, regularization methods, and architectures. Topics include model interpretability, connections to other machine learning models, and computational considerations. Students will analyze a variety of real-world problems and data types, including image and natural language data.\nPrerequisites: DATA 1030 and 1050.\nEnrollment limited to students in the Data Science (SCM) program.",
    "instructor": "Andras Zsom",
    "meets": "N/A"
  },
  {
    "course code": "DATA2050",
    "title": "Data Science Practicum",
    "url": "https://cs.brown.edu/courses/info/data2050/",
    "description": "The capstone experience is a hands-on thesis project that entails an in-depth study of a current problem in data science. Students will synthesize their knowledge of probability and statistics, machine learning, and data and computational science. A faculty member from one of the four core DSI departments (Applied Mathematics, Biostatistics, Computer Science, Mathematics) will oversee the capstone course. Students may collaborate with an additional faculty member, postdoc, or industry partner on projects. DATA 1010 and DATA 1030 are recommended pre-requisites.",
    "instructor": "Andras Zsom",
    "meets": "N/A"
  },
  {
    "course code": "DATA2080",
    "title": "Data and Society",
    "url": "https://cs.brown.edu/courses/info/data2080/",
    "description": "A course on the social, political, and philosophical issues raised by the theory and practice of data science. Explores how data science is transforming not only our sense of science and scientific knowledge, but our sense of ourselves and our communities and our commitments concerning human affairs and institutions generally. Students will examine the field of data science in light of perspectives provided by the philosophy of science and technology, the sociology of knowledge, and science studies, and explore the consequences of data science for life in the first half of the 21st century.",
    "instructor": "Deborah Hurley",
    "meets": "N/A"
  },
  {
    "course code": "ENGN2502",
    "title": "3D Photography",
    "url": "https://cs.brown.edu/courses/info/engn2502/",
    "description": "In 3D Photography, cameras and lights are used to capture the shape and appearance of 3D objects represented as graphical models for applications such as computer animation, game development, electronic commerce, heritage preservation, reverse engineering, and virtual reality. This course covers 3D capture techniques and systems, surface representations and data structures, as well as methods to smooth, denoise, edit, compress, transmit, simplify, and optimize very large polygonal models.",
    "instructor": "Gabriel Taubin",
    "meets": "N/A"
  },
  {
    "course code": "ENGN2520",
    "title": "Pattern Recognition and Machine Learning",
    "url": "https://cs.brown.edu/courses/info/engn2520/",
    "description": "This course is offered as CSCI 1420 for computer science students\nThis course covers fundamental topics in pattern recognition and machine learning. We will consider applications in computer vision, signal processing, speech recognition and information retrieval. Topics include: decision theory, parametric and non-parametric learning, dimensionality reduction, graphical models, exact and approximate inference, semi-supervised learning, generalization bounds and support vector machines. Prerequisites: basic probability, linear algebra, calculus and some programming experience.",
    "instructor": "",
    "meets": "N/A"
  },
  {
    "course code": "XLIST_BIOL_1430",
    "title": "Computational Theory of Molecular Evolution",
    "url": "https://cs.brown.edu/courses/info/xlist_biol_1430/",
    "description": "This course employs intellectual traditions from computer science and biology to investigate the properties and principles of DNA sequence evolution. The roles of mutation, natural selection, population size and subdivision, and genetic recombination are explored. Lectures complemented by web-based computer exercises. Expected: either an introduction to evolution (BIOL 0200, 0480) or to computer science (CSCI 0150, 0160, 0170).",
    "instructor": "Daniel Weinreich",
    "meets": "N/A"
  },
  {
    "course code": "XLIST_ENGN2911-I",
    "title": "3D Photography and Geometry Processing",
    "url": "https://cs.brown.edu/courses/info/xlist_engn2911-i/",
    "description": "In 3D Photography, cameras and lights are used to capture the shape and appearance of 3D objects represented as graphical models for applications such as computer animation, game development, electronic commerce, heritage preservation, reverse engineering, and virtual reality. This course covers 3D capture techniques and systems, surface representations and data structures, as well as methods to smooth, denoise, edit, compress, transmit, simplify, and optimize very large polygonal models.",
    "instructor": "",
    "meets": "N/A"
  }
]